{"id":"219188","timestamp":1453394160,"text":"M&T Bank – Sent them a secured message and they responded with they needed a signature from me.  You can mail them a signed request, but you will be charged a $4 mail closing fee and a $10 official check fee.  You can also close the account in branch for I assume no fees."}
{"id":"219189","timestamp":1453394280,"text":"Citi has allowed me to close a citigold checking by chat in the past."}
{"id":"219201","timestamp":1453397460,"text":"U.S. Bank will not do it over Secured Message. They’d rather do it over the phone or through U.S. Mail."}
{"id":"219202","timestamp":1453397520,"text":"You can close PNC accounts via chat for those who sign up for their bonuses. \nI did this in Jan. 2016 after my $400 bonus posted."}
{"id":"219204","timestamp":1453399020,"text":"I’ve closed citi and BoA accounts in person at a branch.  Cashed out at the teller and spoke with a banker for 5 minutes and got the paper work as a proof of closure.  Seems easier than secure message or through the phone and less chance for any possible fee disputes."}
{"id":"219205","timestamp":1453399380,"text":"PNC allowed me to close my checking account via live chat."}
{"id":"219208","timestamp":1453399860,"text":"Bofa- chat\nChase- secure msg\nCiti- phone, if I remember correctly, when attempting to close through chat, they told me I had to call"}
{"id":"219225","timestamp":1453403880,"text":"My experience closing, how I got the funds and how easy it was. Note that before closing, I always first confirm with the bank that there will be no early termination fee (if I have had the account open longer than the min).\nChase – secure message, ACH’d the remaining balance (easy)\nCapitalOne 360 – called, ACH’d the remaining balance (easy)\nNationwide – secure message, ACH’d the remaining balance (easy)\nAmboy – secure message, ACH’d the remaining balance (easy)\nSunTrust – sent 2 secure messages, mailed me a check for outstanding balance (okay)\nDiscover – sent 3 secure messages, keep getting reply that there is an error in their processing (hard)\nFirstCitizens – it was a nightmare, avoid these folks if possible, had my funds locked up for 2+ months, eventually got a check (hard)\nHomestreet – you have to mail a letter to the branch (hard)\nEverbank – called, they offered me another 6 months at 1.6%, so I kept it open"}
{"id":"219235","timestamp":1453406040,"text":"US BANK???"}
{"id":"219234","timestamp":1453406040,"text":"I was able to close my BofA Business Checking account over the phone."}
{"id":"219240","timestamp":1453406460,"text":"Yesterday I just closed my Citi Savings account via SM.  Last month I downgraded my Citigold to Basic checking with a phone call — Citi wouldn’t proceed with the downgrade via SM or chat."}
{"id":"219249","timestamp":1453408800,"text":"After I got the bonus from Huntington bank and Fifth Third bank, I transferred all the money in there and never used it again. Interestingly, six months passed, they closed my accounts. I don’t have to bother myself to close them."}
{"id":"219259","timestamp":1453410900,"text":"my experience:\nCitizens bank: Phone\nTD Bank: secure message and/or phone\nFirst Niagara: Mail\nHuntington: Chat\nCitadel CU: Secure message\nNationwide: Secure message\nUS Bank: Phone\nCapital One checking: Phone\nCapital One Saving: Online/self\nSantander: Phone\nM&T: In Person and/or Mail"}
{"id":"219268","timestamp":1453414440,"text":"UFB Direct – Repeatedly deposit money orders and then transfer the balance out.  They’ll close it for you. 😉"}
{"id":"219295","timestamp":1453419780,"text":"Thanks for the data points, added them."}
{"id":"219311","timestamp":1453423800,"text":"I was not able to close my Key bank account via SM. I was required to call in."}
{"id":"219316","timestamp":1453426080,"text":"Hey guys how about a list of banks who send out 1099’s on the bonus and allowing us to tell you guys who we have received them from.\nCould be helpful for those who need to file a tax return and dont know if they are getting one.\nI know PNC never does, but Ocean first does.\nChase and T&D not sure about."}
{"id":"219969","timestamp":1453713840,"text":"Closed my Citigold savings account through online chat."}
{"id":"220310","timestamp":1453842240,"text":"Just closed a checking account at Key Bank.  I did it over the phone, talking to a customer service rep.  \nThey said that the process would take 5 business days.  As a monthly maintenance fee was scheduled to be charged during those 5 days, the rep said that she’d void out the fee when it posted.  \nBe sure to ask for this if there’s a monthly fee coming up.  It was implied that otherwise the account, after starting the closing process, would have had the fee charged and would have gone negative, which would have prevented the closing process from finishing."}
{"id":"220331","timestamp":1453848000,"text":"BMO Harris, closure via online chat was no problem."}
{"id":"220430","timestamp":1453872120,"text":"I closed BBT a year or two ago via SM online."}
{"id":"221177","timestamp":1454118840,"text":"jay, you were lucky. I tried to close Huntington by chat, no. Sent a letter to their main office, no. Both times i was told I had to go to the local branch to close the account, so I did. The rep didn’t ask one question why I was closing and was very professional."}
{"id":"222162","timestamp":1454529180,"text":"Anyone have experience closing Igo Bank MM/checking min bal. to avoid fees $25K out of NY. They are very fussy.\nAlso, I may be dumb but, what does the “1 and 1,2” mean after a comment of how to close? Great info. Thanks so much."}
{"id":"223866","timestamp":1455014280,"text":"Astoria Bank you can close by secure message, I was told I could transfer out money and then request account closure.\nThanks for making this list!"}
{"id":"224875","timestamp":1455219900,"text":"Datapoint: I was able to close MountainOne Bank accounts via secure message."}
{"id":"225327","timestamp":1455324960,"text":"Closed M&T over the phone."}
{"id":"232534","timestamp":1457738760,"text":"I just closed a First Niagara account over the phone."}
{"id":"232536","timestamp":1457739000,"text":"I had $0.01 left in an M&T bank account, and tried to close it over the phone.  They could not because of the remaining balance.  \nI had to go in branch to close the account.  (At which point they didn’t care about the $0.01, although they said I could wait in line to withdraw the penny if I felt like it.  I didn’t.)\nSo, you can close an M&T bank account out over the phone, but only if the balance is exactly $0.00"}
{"id":"235360","timestamp":1458589620,"text":"As of 3/21/16.\nCiti – Chat\nHuntington – Chat (feature must be back – it wasn’t showing up for me a few weeks ago, or I was logged on during a time it wasn’t available)"}
{"id":"245481","timestamp":1460583540,"text":"Just closed my Discover checking account by SM.  Quick and easy- they didn’t even bother to reply, just closed it!"}
{"id":"262022","timestamp":1464127800,"text":"data point on first national bank: Just tried calling to close and the rep said in needs to be done in branch because they require photo ID for it."}
{"id":"264701","timestamp":1464882180,"text":"DP here for Citizens Bank. I sent a SM and got this response, helpful if you are looking to close this bank’s account.\nEasy Way\n————-\nAs a more convenient option, you can close the account by transferring the remaining funds into another account that you hold using the “Transfer Funds” menu. Fees may apply. You can also write a check for the remaining balance and cash the item to bring the balance down to zero.\nIf the account is brought to a zero balance, it will close provided there is no activity.\nA closed account can be reopened if any items are presented to the account within 60 business days. If interest is scheduled to post within 7-10 days, the account could be reopened due to the interest credit. Please ensure that you have no outstanding items, and have cancelled any automatic withdrawals or deposits. Once an account reaches 60 business days at zero, it will terminate on the 61st business day; a terminated account cannot be reopened. \nIf you have any further questions or concerns, please contact our 24-hour Customer Service Center at 800 922-9999.\nOR Send Letter\n————\nIf you wish to close your account, you can send a letter to the branch.  \nPlease remember to include your account number, Social Security Number, a phone number we can reach you at, and your full signature.  We also require an address where you would like the account balance to be sent."}
{"id":"266709","timestamp":1465571940,"text":"I recently closed an HSBC Bank checking account.  The procedure is to first remove all the funds, so that the account balance is zero and then call the phone number on the statement and ask them to close the account.  Its best to do this soon after the statement closes because you will be assessed a monthly fee (and probably an overdraft fee, too) if a statement generates between zeroing out the account and the account closure taking effect.  The CSR said that would happen three business days after the call."}
{"id":"267702","timestamp":1465937280,"text":"Additional data point on HomeStreet. I emailed onlinebanking@homestreet.com with a scanned copy of a written letter stating “Please close account # ” and with my signature, and a few days later received an email titled “Action required – Your primary funding account has been deleted”, which I’m taking to mean my account is closed."}
{"id":"271934","timestamp":1467313320,"text":"any datapoint on first tennessee?"}
{"id":"272209","timestamp":1467395220,"text":"Some more data points:\nNorthpointe automatically closed after 30 days of zero balance.\nPinnacle Bank was easy via chat, but I was told it would have eventually closed by itself with zero balance. You’ll need to remember your security question.\nAssociated Bank automatically closed after a couple months of zero balance.\nWells Fargo was easy via SM, though every time I move, USPS informs them and they kindly let me know that they’ve updated my debit card??? Yes, I double checked, the account is still closed…\nThe one thing I find weird is how many banks never notify you when they close these accounts. (Associated bank and Northpointe never did.) Associated bank still sends me CC offers tho. 😐"}
{"id":"272222","timestamp":1467397200,"text":"Data Point:\nSeacoast bank can be closed by phone very easily. They’ll just verify your account information and close it after a brief hold. My account had a $0 balance, so I can’t comment on how they transfer remaining funds."}
{"id":"273305","timestamp":1467806640,"text":"keybank closed my hassle free account via sm this week"}
{"id":"273383","timestamp":1467822720,"text":"Data point for Bank of the West. I sent an SM, and they responded the next day that the account would be closed within 5 business days."}
{"id":"274492","timestamp":1468122900,"text":"Data point for Fifth Third Bank. I tried closing over phone, but was told it has to be done in branch and that the account must have a zero balance before closing (either transfer the money out first or withdraw it in person). Going to a branch, though a slight annoyance, was quick and painless. They asked for ID and confirmed some details about the account before closing it."}
{"id":"276237","timestamp":1468617000,"text":"First Tennessee:\nI was able to close my checking account over the phone.  I did not try any other methods.  I ensured that my account was at a zero balance before attempting to close it."}
{"id":"280081","timestamp":1470058920,"text":"Closing your account at Santander Bank does not shut off bill pay.  If you have set up a monthly bill pay from your checking account, make sure to cancel it before going into the branch to close the account.  If you don’t do this, Fiserv (their bill pay service) will attempt your next scheduled bill pay.  It will fail because the account is closed, and it will cost you $39 in fees.  I found out about this the hard way."}
{"id":"281031","timestamp":1470280080,"text":"I closed my checking and savings accounts at Regions Bank and Tech CU by secure message. In each case, I sent the initial request, the bank replied asking for confirmation, I confirmed, and the bank closed my accounts.\nBased on the Regions Bank message, if the value of your accounts is less than $1,000, Regions Bank will close the accounts by secure message and mail the balance to the address of record. If your balance is greater than $1,000, there were other requirements (I forget what — notarized something?). I had more than $1,500 with Regions to keep my checking account fee-free, so I drew my savings account down to $0 and my checking account down to $50, waited for the transactions to complete, then confirmed my intent to close the accounts.\nWith Tech CU, my checking balance was $0 and my savings balance was $25 when I made the request."}
{"id":"283339","timestamp":1470989460,"text":"I called NorthPointe Bank  .. talked to CSR who advised me to ACH* pull funds to zero account balance and call them to close.when the account balance is zeroed out.\n*ACH sent by Northpointe Bank has a $3.00 fee.  Instead, I had the destination bank ACH pull the funds.  No fee that way."}
{"id":"283691","timestamp":1471108320,"text":"Bank of America credit cards- I dont see a way to cancel this via secure message. The only option is to order statements. Also they wont close via Chat..they make you call…anyone else have any other experiences?"}
{"id":"284448","timestamp":1471371780,"text":"Fidelity Bank( https://www.doctorofcredit.com/pa-only-fidelity-bank-offering-200-checking-100-savings-bonus-2/ ):\nI don’t live in PA(for reference, you can open accounts with them and get the bonus if you open in branch, regardless of where you live).  I contacted a CS rep using their online chat feature.  They first told me to go to a branch to draw down the balance and close the account.  I told them I didn’t live near any branch, and I had already zero’d out the account.  They said that since the account was already at $0.00, they could close it, and proceeded to do so.  \nTLDR: Fidelity Bank: can be closed by online chat, as long as your balance is at $0.00.  \nFive Star Bank( https://www.doctorofcredit.com/five-star-bank-250-rochester-ny-in-branch-checking-bonus/ ):\nI called in to close my account(balance was $0.00).  They first said to go to a branch to close, I told them I didn’t live near a branch(again, opening in branch and getting bonus worked despite not living in their service area).  They said they could not close over the phone, but as long as my balance remained at $0.00 for 10(business?) days, they would automatically close my account.  That worked.  \nTLDR: Five Star Bank: Either go to a branch, or zero out your account and wait 10 business days."}
{"id":"284502","timestamp":1471382340,"text":"I was also able to close my First Tennessee checking account via SM. They replied back asking for my mailing address. After my response, they “forwarded my request to the correct department,” and my account was closed.\nI chose to close my Santander checking and savings accounts by phone. Although it appears you can send them email, there are about a dozen disclaimers about how insecure the email is, so I didn’t go that route. The first time I called, the representative told me I had to withdraw the money from the accounts before they could close them. I set up transfers to other accounts. After these had finished, I called back and was able to close the account."}
{"id":"284947","timestamp":1471483980,"text":"Amalgamated Bank\nIf the balance is zero you can close the account by calling 800-699-3679.\nhttps://www.amalgamatedbank.com/contact-us\n“How do I close my accounts(s)?\nIf there is money in the account, you can close your account by visiting your local branch or by mailing a written request.  When submitting a written request, please include the account number(s) that you are requesting to close.  Additionally,  for your security, the letter must be signed.  The money will be sent to the current address on record.\nPlease send the written request to:\nBranch Administration\nAmalgamated Bank\n275 Seventh Avenue\nNew York, NY  10001\nIf the account has a zero balance, you may close your account by calling us at 800-699-3679.”"}
{"id":"287779","timestamp":1472070720,"text":"Talmer Bank\nMust go in branch or send notarized letter with Drivers License\nNo SM feature in online banking, customer support unwilling to process over the phone"}
{"id":"292299","timestamp":1473196980,"text":"I was able to close BoA Checking account through chat – one extra confirming data point."}
{"id":"293105","timestamp":1473381660,"text":"Is there a reason why this isn’t shown publicly under the knowledge base links at the top or is it kind of out of the way since some banks check this site out and prefer that you not share this information? Thanks for your hard work and everyone’s contributions!"}
{"id":"293114","timestamp":1473384240,"text":"I messaged Iberiabank and asked them to close my savings account. They replied and asked me to call. I called, and they said I had to go to a branch. Since it is a fair distance to a branch, I decided to close both my checking and savings accounts, and I was able to do so in-branch."}
{"id":"293256","timestamp":1473424800,"text":"Citi Checking account: balance at $0, closed over online chat."}
{"id":"296185","timestamp":1474118460,"text":"Amalgamated Bank Account Closure Datapoint: \nContacted Amalgamated through the secure messaging online and asked them to close my bank account. They first wanted to have my account balance at $0.00. After that, I messaged them again and after about a week or so, I received an email stating that my Convenience Plus Checking account with them was deleted.\n I guess that means we can cancel accounts through secure messaging with them as long as we zero the balance… unless there is the possibility that they delete/close accounts with a $0 balance after only a week (which I find very unlikely)"}
{"id":"297109","timestamp":1474402080,"text":"Popular Community Bank: Closed by secure message\nTD Bank: Closed by secure message.  They say it takes 2-3 business days to close, during which any charges could prevent it from being closed out."}
{"id":"298999","timestamp":1474815720,"text":"I closed my fifth third Bank account with a letter. Back in March 2016. They sent me cashiers check."}
{"id":"301887","timestamp":1475276400,"text":"Just reporting a datapoint for First Niagara here though it won’t matter too much since First Niagara will disappear in a few weeks when Key Bank finally takes over all of the branches. Reporting here just for those who might be interested maybe? lol\nDidn’t get a response until this morning. Sent them two messages asking to close account with first message on September 25th and 2nd one on 28th.\nClosed account through secure messaging via Online Banking:\n——————————————————————————————\nFrom:\nReceived:\t09/30/2016 08:47 AM EDT\nSubject:\tRe: Request to Close Checking Account\nMessage:\tDear Pablo ,\nThank you for contacting First Niagara Bank. \nI have closed the account as requested. \nI hope that you have found this information helpful and apologize for any inconvenience. Should you need further assistance, please call the Customer Contact Center at 1-800-421-0004. Hours of operation: Monday-Friday 6am to 9pm & Saturday-Sunday 8am to 6pm, Eastern. \nThank you for choosing First Niagara Bank and have a great day! \n*To assist First Niagara with keeping our records up to date please provide your current email address. Also please verify that your physical/mailing address and phone numbers are current.* \nSincerely, \n—————————————————————-"}
{"id":"302613","timestamp":1475437260,"text":"Wife and I both closed KeyBank accounts through SM this past week. We had zero’d the balances before sending the SM’s. I generally find it easier to close an account this way (SM) if you withdraw all the money first."}
{"id":"304091","timestamp":1475776080,"text":"Recently closed santander over phone, citbank gold over private chat, first tennessee over secure message, and today chase over phone. DATA POINT: I was told I had to get a notary for Talmer Bank or go into the branch, Im choosing to get a medallion stamp from a different bank and send in the letter."}
{"id":"304971","timestamp":1476045600,"text":"Closed FirstBank a while ago via chat."}
{"id":"308323","timestamp":1477085580,"text":"Some DPs this week:\nTried to close checking account with Pinnacle Bank Texas via chat. Told I had to go in-branch. Tried to call — same result. Closed account in-branch.\nClosed checking accounts with Northpointe Bank, LegacyTexas Bank, and U.S. Bank by phone.\nDrew all accounts to $0 via transfers or bill pay before attempting to close."}
{"id":"308622","timestamp":1477232520,"text":"I closed 5/3rd bank over the phone, a previous CSR said the account must be $0 to close over phone, when I called to close the CSR said I had to go in branch…I mentioned previous CSR said I could close over phone with $0 balance, she then closed it so be persistent."}
{"id":"312679","timestamp":1478397480,"text":"You can’t close Chase Business checking with a SM.  They replied with:\nHere are the options for closing your account:\n1. Visit any of our branches and present a driver’s\nlicense or other valid government-issued photo ID\n2. Call us at the number below (only for accounts with a\nbalance below $5,000, other limitations apply if your\naddress recently changed)\n– Send a signed written request to the address or fax\nnumber below (only for accounts with a balance below\n$100,000). Please include this information:\n– Your full name as it appears on the account\n– Account number\n– Social Security Number/Tax ID Number\n– Current address\n– Current phone numbers (daytime and evening, with area\ncodes and country codes)\n– Your preference for receiving the money that remains in\nyour account: by U.S. mail or account transfer to another\nChase deposit account (include the account number).\n– Signature and the date (for accounts with a balance\ngreater than $1,000, your signature must be notarized).\nHere’s our contact information:\nJPMorgan Chase\nNational Account Closing TX3-7861\nPO Box 659516\nSan Antonio, TX 78265\nFax: 1-225-332-7787\nFor overnight delivery:\nJPMorgan Chase\nNational Account Closing TX3-7861\n20855 Stone Oak Pkwy\nSan Antonio, TX 78258"}
{"id":"316844","timestamp":1479516660,"text":"My wife withdrew all money from her Pinnacle Bank Texas checking account (it’s fee-free). After a month, the account was closed."}
{"id":"317350","timestamp":1479687720,"text":"DP’s:  Closed both Associated Bank and BMO Harris – Called phone # on the back of the debit card.  (I recommend this method for all banks, unless they want it in writing, in order to ask the question about any closure fees/bonus clawbacks.)"}
{"id":"320840","timestamp":1480368420,"text":"Opened a no-fee account with Pinnacle Bank of Nebraska a few months ago for the $100 bonus even though I’m in Colorado. After receiving, cleared it out. Account closed as of this week automatically. Convenient as I was planning to do it myself at some point."}
{"id":"321176","timestamp":1480441740,"text":"DATA POINT:\nClosed amalgamated bank by live chat, I had zero balance for 3 months, previous datapoint of account being closed after 30 days of inactivity and 0 balance is incorrect. However, I was not hit with a monthly fee like associated bank."}
{"id":"323289","timestamp":1480948260,"text":"DP: for Citi, I’ve downgraded the account via chat and SM."}
{"id":"323762","timestamp":1481036460,"text":"New update for Huntington:\nChat and SM no longer exist even as options on the website, and haven’t for at least 6 months it seems. \nIf you have a balance, you can close in branch. If you bring it down to $0.00 first, you can close over the phone."}
{"id":"324139","timestamp":1481089920,"text":"Please add DP for BBVA Compass NBA checking- closed through Secure Message"}
{"id":"324210","timestamp":1481122500,"text":"Closed TD Bank acct on phone. Rep mentioned that “because you have a zero balance I can go ahead and close the account.”"}
{"id":"329746","timestamp":1482294000,"text":"Drained LegacyTexas Bank checking account to zero balance. The bank closed the account on their own after about two months of zero balance."}
{"id":"330741","timestamp":1482538080,"text":"Tried to close Pinnacle (Nebraska) Diamond Secure account in chat (with a zero balance), was told to contact my local branch."}
{"id":"335898","timestamp":1483976220,"text":"SunTrust, closed fast after sending a secure message Jan 2017."}
{"id":"336078","timestamp":1483996800,"text":"Closed Santander over the phone today"}
{"id":"337271","timestamp":1484170260,"text":"Level One Bank\nPer CSR – require written request by fax or mail otherwise come into the branch.\nWritten request: simply a letter with date, name, address, account number, signature, with request to close.\nFax: 248-479-1742\nLevel One Bank\nATTN: Deposit Operations\n32991 Hamilton Ct\nFarmington Hills, 48334"}
{"id":"337288","timestamp":1484173140,"text":"Sent Fifth Third an account closure request via SM yesterday morning and never received a reply. Since my account was set to get hit by a maintenance fee tomorrow, I called in to customer service just now. The representative very quickly closed out the account for me, no questions asked. I zeroed out the balance a little over a week ago in preparation for closing."}
{"id":"338832","timestamp":1484421360,"text":"Closed Santander biz checking by phone today"}
{"id":"340777","timestamp":1484779320,"text":"DP: (WI) Bank & Trust – Zero balanced, then called number on back of debit card.  Account closed over phone.\nBut previously, when I called the direct line on website to WI Bank & Trust, I got told a letter would need to be mailed or go into a branch in person.  So FYI, debit card phone number is the better one to use."}
{"id":"340872","timestamp":1484797020,"text":"DP: First National Bank of PA – Account closed via SM.  I pre-zeroed the account, and let them know I am out of state."}
{"id":"342176","timestamp":1485036600,"text":"New/updated limits for Chase personal accounts:\n“Here are options for closing your account:\n1. Reply to this message or call us at the number listed\nbelow (only for accounts with a balance below $5,000,\nother limitations apply if your address recently changed).\n-Tell us the reason you are closing the account.\n– Tell us how you want to receive the money that remains\nin your account. There are two options either by U.S. mail\nor account transfer to another Chase deposit account\n(include the account number).\n2. Visit any of our branches and present a driver’s\nlicense or other valid government-issued photo ID.\n3. Send us a written request to close your account (only\nfor accounts with a balance below $100,000). Please\ninclude the following information with your request:\n– Your full name as it appears on the account(s)\n– Your full account number(s)\n– Your full Social Security Number\n– Your current address\n– Your current phone numbers (daytime and evening, with\narea codes and country codes)\n– How you want to receive the money that remains in your\naccount: by U.S. mail or account transfer to another Chase\ndeposit account (include the account number)\n– Your signature and the date (For accounts with a balance\ngreater than $1,000, your signature must be notarized)\nHere’s our contact information:\nJPMorgan Chase\nNational Account Closing TX3-7861\nP.O. Box 659516\nSan Antonio, TX 78265\nFax: (225) 332-7787\nFor overnight delivery:\nJPMorgan Chase\nNational Account Closing TX3-7861\n20855 Stone Oak Pkwy\nSan Antonio, TX 78258\nPlease make sure all outstanding items have cleared your\naccount before it closes. If any outstanding items (such\nas checks, authorized ATM/debit card transactions, direct\ndeposits or other automatic/recurring debits or credits)\nare presented to this account, the items will either be\nreturned unpaid, or could possibly re-open the account.\nIf you need any other assistance, you can send us a secure\nmessage. We appreciate your business and thank you for\nchoosing Chase.”"}
{"id":"344258","timestamp":1485454380,"text":"Transferred all my cash out and then closed Associated Bank via online chat. Quick and painless. Took less than 5 minutes. I logged in a few minutes later and it notified me that I had no accounts. I saved the chat just in case."}
{"id":"348167","timestamp":1486098480,"text":"M&T – Zeroed balance, then sent SM.\nBMO Harris – based on recommendation of a secure chat CSR days prior to my planned close date, I did NOT zero balance and called in to close account.  Cashier’s check for entire balance arrived in about 5 days."}
{"id":"349336","timestamp":1486418220,"text":"Recently closed two Keybank checking accounts via SM with no questions asked."}
{"id":"350668","timestamp":1486639920,"text":"I just closed a Discover Savings account by secure message after withdrawing all the money. It was processed in less than 12 hours. I received an email telling me that a small amount of interest (may be in this month until the account is closed) will be sent by check. Logged in and saw no open account any more. It’s fast and easy."}
{"id":"351877","timestamp":1486835040,"text":"For M&T, additional accounts can be closed via SM.  However, if closing all accounts or last remaining account, supposedly must be done in person, or via mail.  I had already zeroed my last account.  Closing by mail costs $4.  I am going to try by phone once I get their firm 180 day mark via SM, because they are being sticklers about charging me $50 if less than 180 days.  From my experience, most banks seem to allow some room to the 180 day rule and as long as you are close (within the correct statement period, I assume), you are good to go.  Not M&T apparently."}
{"id":"351880","timestamp":1486835280,"text":"DP: Suntrust – Closed via SM, scheduled for next processing day.  I had already zeroed balance."}
{"id":"352472","timestamp":1486950840,"text":"As we all know, many banks and CUs have an early termination fee if the account is closed before six months.\nCan the DoC staff or other knowledgeable folks explain what a safe definition of “six months” is? \nIs waiting exactly six months plus 2 business days sufficient to protect myself from any ET fee?  Or do I need to additionally wait until the day after my next bank account statement prints?\nWhen the six month period includes February (only 28 days) should I include another two days?"}
{"id":"355500","timestamp":1487318700,"text":"DP:\nSuccessfully closed 2 BMO Harris accounts with their own Account Closing form located at https://www.bmoharris.com/pdf/personal/account-closing-form.pdf\nJust filled in the relevant info and send it to BMO Harris Bank N.A. 1200 E. Warrenville Rd Naperville, IL 60563\nWorked like a charm…cashiers check with the remaining balance received in about 10 days."}
{"id":"357051","timestamp":1487605860,"text":"I make a quick (< 5 min) call to Keybank to close my account. Just told them I was consolidating accounts when asked."}
{"id":"361729","timestamp":1488293160,"text":"Christian Community Credit Union – closed by SM.\nFifth Third – zeroed out and then closed by phone.\nKey – closed by phone.\nChase Savings – closed by SM."}
{"id":"362381","timestamp":1488379140,"text":"Feb 2017:\nM&T – had to zero out and required to close by phone or branch.  Presumably in branch you don’t need zero since you can withdraw there. \nCity National Bank (CNB) – closed over phone, needed zero balance. But this was very quick, faster than most I’ve experienced."}
{"id":"362725","timestamp":1488421680,"text":"Just closed my Tiaa Direct checking with 0 balance by online banking message today."}
{"id":"365995","timestamp":1488925500,"text":"3/7/2017- Closed Discover account through SM. Pretty easy and no questions asked. Got response in around 4 hrs of time."}
{"id":"367036","timestamp":1489032660,"text":"Close account through secure message for PNC.\nThere is a $25 fee if your account was not open 180 days."}
{"id":"368766","timestamp":1489340760,"text":"Christian Community Credit Union is at the wrong heading level."}
{"id":"375284","timestamp":1490238840,"text":"Managed to close my American Eagle Financial Credit Union Checking/Savings account via online secure messaging. Just asked them to close my account and then a few days later, they simply closed it and received a check from them a few days later. Check was $5 left in my savings account (after withdrawing all of the available money)."}
{"id":"375724","timestamp":1490312280,"text":"I can confirm that PNC allows you to close accounts using chat."}
{"id":"376085","timestamp":1490368380,"text":"I just closed my Flushing Bank account by secure message."}
{"id":"378067","timestamp":1490666460,"text":"Add DP for Northwest Bank. Need to write a letter or go personally."}
{"id":"385548","timestamp":1491602700,"text":"DP: closed Centennial Bank and Trust checking account on the phone.\nBizarrely, they auto-closed the savings account I had with them once I brought the balance down to $0 as soon as the statement cycle closed."}
{"id":"387935","timestamp":1491947460,"text":"Mountain America Credit Union must be closed by phone.  Chat with online rep did not work.  Number was 800-748-4302"}
{"id":"388347","timestamp":1492009080,"text":"To clarify on closing the CapitalOne360 savings account, the Close Account button is under your account and then the small Details tab to the left of the current tab. Scroll to the bottom to close account."}
{"id":"388796","timestamp":1492062060,"text":"Contrary to what’s been reported here, I was able to successfully close a U.S. Bank checking account through SM.  \nI sent a SM asking if I could close my account and I was given a few options, one of which was to reply to the email and provide my address on file. I confirmed the address and later that same day I was told it was closed and to expect a check in 3-5 business days. Hasn’t been long enough to follow through with the process but if I have any issues I’ll reply to this comment."}
{"id":"390075","timestamp":1492267980,"text":"I closed my HSBC account via “bankmail”, their secure message system."}
{"id":"395354","timestamp":1493079000,"text":"HSBC: Withdrew balance then closed by SM. Confirmation reply the next day."}
{"id":"397591","timestamp":1493395320,"text":"Another DP for Wells, closed via secure message. Only took 15 min for them to respond. Need to be at zero balance."}
{"id":"397596","timestamp":1493395800,"text":"Withdrew both Discover checking and savings as well as FirstBank to $0. Sent secure message to close and both accounts were closed within ours."}
{"id":"398923","timestamp":1493680020,"text":"Flushing Bank DP – called to close and they (customer service) couldn’t close over the phone because the account had been opened in-branch. I called the branch I opened the account with and closed over the phone. They will mail me a check with the balance."}
{"id":"398924","timestamp":1493680080,"text":"Santander DP – closed account by phone, as suggested here. Will mail a check in 7-10 business days."}
{"id":"400111","timestamp":1493823900,"text":"5/3/2017 – Fifth Third Essential Checking Account closed via phone. Had already zeroed out my balance beforehand. Rep said he filled out a form which would take 2 business days to process. Phone call lasted about 1 minute."}
{"id":"401241","timestamp":1493922780,"text":"FCB Banks, referenced here: https://www.doctorofcredit.com/mo-fcb-south-county-bank-125-checking-bonus/\nCalled customer service to close account, was told that since there was a balance ($10) she couldn’t close over the phone, but if I ACH the money out the account will close automatically after 10 business days of 0 balance."}
{"id":"405688","timestamp":1494635940,"text":"TIAA Direct – transferred all the fund out, waited until cleared. Sent secure message, acct closed the same day.\nHSBC – the same\nBancorp – Since I lived near a branch, I came in to close, took 5′. It doesn’t matter if you have fund in the account as long as you come to a branch, they can withdraw it and close the acct. Just make sure there is no pending transaction in the acct."}
{"id":"410008","timestamp":1495644480,"text":"DP: closed my citi checking via online chat."}
{"id":"410041","timestamp":1495648500,"text":"DP: closed KeyBank via Secure Messaging. Left money in there to cover the Early Term Fee."}
{"id":"410240","timestamp":1495671060,"text":"DP: closed Webster Bank via Secure Message."}
{"id":"413810","timestamp":1496438400,"text":"Closed PNC checking and savings via chat. Was able to waive the $25 early closure fee by asking."}
{"id":"414001","timestamp":1496495160,"text":"DP: Closed associated bank via live chat"}
{"id":"416948","timestamp":1496897520,"text":"Got the 500.00 bonus sign up accounts last Thanksgiving time.  After the bonuses paid, I switch account types and lowered my required account balances to keep fee free.  I pulled out all funds over that about three months ago.\nI called my Chase bank and verified that I was past six months at the end of May.  Banker can close and cut a check in branch. He made me call the normal telephone banking number since I was not in branch.\nI called that number and ordered my accounts closed. No real problems doing so.  I got my checks within two weeks.  Done deal."}
{"id":"416950","timestamp":1496897760,"text":"Pinnacle Bank – Nebraska.  Closed in branch – walked out with check same day since that account had no activity the previous ten days.  Banker took my word nothing pending."}
{"id":"417108","timestamp":1496933760,"text":"Citi Checking:\nDowngraded via Chat\nClosed via Chat"}
{"id":"423265","timestamp":1497890160,"text":"Also, Wells Fargo needed to go in branch, there was no way to do it otherwise"}
{"id":"423263","timestamp":1497890160,"text":"Closed my Citi checking via chat. They needed me to activate my checkbook first, then closed it straightaway"}
{"id":"426302","timestamp":1498241760,"text":"Closed HSBC via secure message. Zeroed out account via bank transfer prior to sending SM, and began closure process at beginning of new statement cycle as advised by DOC."}
{"id":"427311","timestamp":1498442460,"text":"Will, FCB South County Bank looks like the wrong heading style too.\nNot important, but it throws the table of contents ever so slightly off."}
{"id":"427701","timestamp":1498502460,"text":"Hancock Bank: Closed via fax. Other options are phone call or show up in person. They specifically do not allow account closure via secure message.\nAlso of note: They charge you $8 to mail you a check if there’s not a zero balance at closing. Also, they charge $3 to do ACH push to another bank (regardless the reason for the transfer). This applies to Access Checking account. So I wrote myself a check to get to a zero balance before closure. \nClosure by fax was completed within one business day. \nI would think the above would apply to Whitney Bank as well."}
{"id":"428714","timestamp":1498594860,"text":"Tried SM with Chase biz, no go.\nHere are the options for closing your account:\n1. Visit any of our branches and present a driver’s\nlicense or other valid government-issued photo ID\n2. Call us at the number below (only for accounts with a\nbalance below $5,000, other limitations apply if your\naddress recently changed)\n– Send a signed written request to the address or fax\nnumber below (only for accounts with a balance below\n$100,000). Please include this information:\n– Your full name as it appears on the account\n– Account number\n– Social Security Number/Tax ID Number\n– Current address\n– Current phone numbers (daytime and evening, with area\ncodes and country codes)\n– Your preference for receiving the money that remains in\nyour account: by U.S. mail or account transfer to another\nChase deposit account (include the account number).\n– Signature and the date (for accounts with a balance\ngreater than $1,000, your signature must be notarized).\nHere’s our contact information:\nJPMorgan Chase\nNational Account Closing TX3-7861\nPO Box 659516\nSan Antonio, TX 78265\nFax: 1-225-332-7787\nFor overnight delivery:\nJPMorgan Chase\nNational Account Closing TX3-7861\n20855 Stone Oak Pkwy\nSan Antonio, TX 78258\nIf any outstanding items such as checks, authorized\nATM/debit card transactions, direct deposits, or\nautomatic/recurring debits or credits are presented to\nthis account before we can process the closure request,\nthey may be paid or returned, depending on the status of\nthe request at that time. Once the account is closed,\nthese items will be returned unpaid. \nWe appreciate the opportunity to help you. We value our\nrelationship with you and thank you for choosing Chase.\nPlease contact us anytime if you need assistance."}
{"id":"435244","timestamp":1499448780,"text":"Pinnacle Bank:\nTried secure message, told no.\nTried online chat, told no.\nHad to call a branch and speak to them in person.  I live in Iowa and not close enough to any branch to actually walk in.  The call was fairly painless."}
{"id":"438433","timestamp":1499891220,"text":"TD Bank – SO’s account: After 90 days, made sure a statement recently posted, then zeroed balance.  Then, after transaction cleared, sent SM requesting close.  No response after two days.  Sent SM again, and after 24 hours, recv response:\n“Your request to close your account ending in **** is being processed. The account will be closed within 2-3 business days. If a transaction posts within this time frame there is a possibility the account may not close.”\nTL;DR:  They take longer than most banks to close the account.  Make sure you have time before statement cycle ends."}
{"id":"440629","timestamp":1500218940,"text":"Hey Doc, great website, love using it.\nSomething you might consider adding to this post is the process for closing the account, with regards to how to get your money out. Do you leave your minimum balance in, and then when closing, ask for a check or transfer to zero it? Or do you zero it out with ACH prior to contacting the bank to close? In the latter case, are you worried about your balance dropping below the minimum and incurring fees?\nI see comments suggesting this may vary from bank to bank, would be interested in your input.\nThanks"}
{"id":"441271","timestamp":1500310740,"text":"I was able to close Northpointe account via their chat system. The chat is available at their login page. All they need is name, date of birth, and last 4 SSN digits to verify your identity."}
{"id":"442787","timestamp":1500521640,"text":"Just closed Bank of America checking over phone. 12 mins on hold and then took >5 mins on phone. Called main line and said “close account.” No pushback from rep. \nBalance if I had one would be mailed via cashiers check. Snailmail confirmation of account closure on deck"}
{"id":"445759","timestamp":1500934920,"text":"Tried to close Fifth Third by SM and received this reply:\n“Thank you for choosing Fifth Third Bank. I will be happy to provide you with information on how to close your account. I am unable to close the account via email request and I apologize for any inconvenience this may cause. In order to close your account, please visit a Fifth Third Banking Center to complete your request. A signed letter may also be mailed or faxed to the Banking Center maintaining your account. Your Banking Center information is below:\n<>\nMany Banking Centers require proof of identification to close an account via a mail or fax request. If you are intending to mail or fax the request, please call your Banking Center for complete instructions and select option 3.\nPlease specify in your letter how you would like any credit in your account disbursed, such as transferred to another account or mailed as a check. Also, an account in a negative balance cannot be closed and we recommend you discuss this with your Banking Center.”\nFor PNC, I was able to close via SM by confirming the last 4 digits of the account and the address on file."}
{"id":"447137","timestamp":1501091940,"text":"We recently closed checking accounts at Fifth Third, Regions, and TD Bank via secure message.\nWe also closed a checking account at Capital One 360 by phone."}
{"id":"447716","timestamp":1501166760,"text":"Closed PNC via SM. Took about 48 hours for them to close it from the time that I sent the SM."}
{"id":"450089","timestamp":1501528320,"text":"Does anyone know a phone number to call to close Santander account?  I’ve looked at the DPs and there’s no information on what number these people called.  I’ve tried 1-877-768-2265, but there is no option for personal checking accounts or debit accounts."}
{"id":"454685","timestamp":1502137680,"text":"Didn’t see a DP, so I figured I’d add my own!  Closed a BB&T checking account through a secured message after zeroing it out.  Representative also said that you could close via phone after zeroing out the account, but did not specify the phone number.  It took two business days for them to close it."}
{"id":"455210","timestamp":1502208420,"text":"Fifth Third – closed via SM after zeroing balance\nPNC (Virtual Wallet and Standard Savings) – closed via Chat. Had them cut me a check for hte remaining balance"}
{"id":"459170","timestamp":1502822280,"text":"Capitol One 360 Checking\nAttempted to Fax request to close, they left a voicemail to call them\nWas able to close via Chat later that day, account balance was zero."}
{"id":"459199","timestamp":1502825880,"text":"Requested a Quorum FCU close over the phone.  \nA better method may exist, didn’t want to go back and forth with SMs if it wasn’t possible – as don’t see any DPs yet."}
{"id":"459358","timestamp":1502840880,"text":"Datapoint: was able to close one of my 2 accounts with Radius Bank via SM. Account had $0 balance."}
{"id":"467256","timestamp":1503943980,"text":"Closed PNC over chat, US Bank on phone, Capital One Savings on the web login and Chime over SM."}
{"id":"468358","timestamp":1504040940,"text":"BoA Bank of America – Core Checking\nphoned in to close. quite easy. transferred the last $100 from BoA core checking to BoA regular savings while i have the csr on the line (kept savings for $30 quarterly BoA BBR bonus). she read some disclosures. mentioned that my current debit card would stop working but they’ll mail an ATM card for me to access my savings fund. refreshed my online banking and core checking is gone. ezpz. \ni’ve had my checking with them for 6 yrs but now that i’m getting into bank bonuses, i figured it’s time to ditch them and maybe they’ll target me for a checking bonus in the future. *i’ve opened 7 (bonus) accounts just this month alone. i’m quite late into the game so i’m trying to catch up. lolz. 2 more planned – chase savings & wells fargo checking. goodluck everyone! and thanks DoC!!!"}
{"id":"470393","timestamp":1504360020,"text":"Want to add data point for BMO Harris – LIVE CHAT.  Their process was asinine but ultimately ok. Most banks tell you to draw your balance down to zero, then secure message or call.  Not BMO.  YOU CAN NOT DRAW YOUR BALANCE DOWN TO ZERO USING EITHER EXTERNAL TRANSFER OR BILLPAY.  The system will not allow you, saing you have insufficient funds. I found out the hard way from a phone rep.  So you draw it down to ONE CENT like I did, then secure message them, then they snail mail out a form that you have to fill in and mail back, and then they issue you a certified check for the remaining 1 cent.  In my case I was sufficiently annoyed at the time/effort involved in mailing it back so I signed, scanned, and sent in via secure message.  No dice, they secure messaged back saying that I had to snail mail.  So then I went to complain via chat (on Labor Day weekend, no less) and the lady said she would take care of it.  So…CHAT WORKED."}
{"id":"473418","timestamp":1504841340,"text":"Just got this reply when asking m&t to close one of my accounts thru sm:\nThank you for submitting your account closure request.\nYou may close your account by visiting your local M&T branch or by mail. To process this request, your signature is required and bringing the account to a zero balance will not automatically close it. \nIf you are unable to visit an M&T Bank branch, please send your signed request to the following address.   M&T Bank PO Box 1258  Buffalo, NY 14240  \nThere is a $10.00 Official Check fee to mail your remaining balance to you. Additionally, a $4.00 mail closing fee will be assessed.  \nTo avoid the Official Check fee, you may wish to:  – Write a check for your balance, or – Transfer funds to another M&T account online or by phone at 1-800-724-2440.\nThis means no more closing an account by sm. To note this was not the last remaining account."}
{"id":"476382","timestamp":1505325720,"text":"D.P-\nClosed wells fargo via secure messaging after bringing the balance down to zero ."}
{"id":"477068","timestamp":1505422440,"text":"Just closed Chase total checking and chase business total checking. \nPersonal checking was closed via an with $0.00 balance. \nTried to close business checking by sm, unable to do so. Closed via phone call with $0.00 balance."}
{"id":"477661","timestamp":1505509560,"text":"I closed HSBC by phone. Although I had e-statements the next month they charged me an overdraft fee and service charge, but then immediately backed it out so the net impact was zero."}
{"id":"477664","timestamp":1505509680,"text":"Huntington DP – *Personal* account can be closed via chat once at a zero balance. If you transfer from Personal to Business, it still needs to process overnight in order to close Personal, even though it shows on your account instantly."}
{"id":"480853","timestamp":1506011220,"text":"DP: I was able to SM Northwest to close my checking account.  Once it’s been approved and closed I will reply."}
{"id":"481413","timestamp":1506098220,"text":"Fifth Third Bank — checking account with zero balance\n9/20 Sent secure message to close account (select “Opening/Closing Account” option in dropdown list)\n9/20 Missed a phone call from them (didn’t bother calling them back)\n9/22 Account finally closed"}
{"id":"481550","timestamp":1506112380,"text":"With Santander, if you close over the phone they tell you a bazillion times how unsecure sending a check is and that they’d like you to transfer out the money first. If you insist on receiving a check, then eventually they tell you that if the balance is more than $500 you have to send a notarized request to receive the check. -_-"}
{"id":"482982","timestamp":1506433200,"text":"I was able to close two more Capitol One 360 Checking (me and player 2) accounts via Chat this morning, both accounts had $0 balance"}
{"id":"483133","timestamp":1506456600,"text":"BMO closed via chat. Online profile still exists with statements.\nRegions closed via SM, and even followed up with SM, but the account is deactivated so it can’t be read.\nPNC closed via chat, very quick and easy.\nQuorum closed via phone, quick 7 min call."}
{"id":"483347","timestamp":1506487680,"text":"For Chase Regular Checking account and Regular Saving account you just need to make sure you have zero balance before your bill cycle starts and can Private Message them to close the account!"}
{"id":"484082","timestamp":1506617400,"text":"DP: Closed Citibank checking via SM officially 9.27.17."}
{"id":"487567","timestamp":1507146780,"text":"BMO Harris closed via chat. Was closing 2 of 3 accounts so was able to zero them out first by transferring balances to checking. Could not close via SM."}
{"id":"488073","timestamp":1507219860,"text":"Closed BMO Harris Checking and Savings via Chat. Did *not* zero out balance, and they will send 2 separate checks in 7-10 business days."}
{"id":"488515","timestamp":1507247400,"text":"DATA POINT for FIRST MERCHANTS BANK\nAccount must be closed in branch only, or it will auto-close after 45 days of $0 balance."}
{"id":"489120","timestamp":1507314240,"text":"Closed US Bank Korean Skypass Credit Card through US Banks Online Banking “Email Us” feature on their Customer Service – Contact Us section. Took about 3 days to respond to confirm."}
{"id":"489124","timestamp":1507314660,"text":"DP: Capital One 360 checking was able to close it thru chat. account was at zero balance."}
{"id":"491543","timestamp":1507674540,"text":"Was able to close Hancock Bank over the phone today by calling 1800-448-8812.\nThe account had a $0 balance when I closed it."}
{"id":"491638","timestamp":1507686900,"text":"Re-affirming DP:\nCapital One 360 Savings and Money Market accounts can be closed via the site\nhttps://secure.capitalone360.com/myaccount/banking/closeAccount?\nInfo here:\nhttp://helpcenter.capitalone360.com/bnk/Topic.aspx?category=C3BNKOSABA#OSA10-14"}
{"id":"495566","timestamp":1508260980,"text":"Closed Hancock account by phone. Secure message was not allowed. 10-15-17\nClosed M&T by secure message. 10-17-17"}
{"id":"496050","timestamp":1508328180,"text":"Chase Bank checking closed by secure message with $0 balance. Also closed Hancock Whitney Bank checking via phone call with $0 balance."}
{"id":"496518","timestamp":1508379960,"text":"Closing PNC account via chat was the quickest and most painless experience.\nMake sure it’s been 6 months before you close to avoid any fees."}
{"id":"500030","timestamp":1508862900,"text":"I closed Associated Bank by zeroing out the account and then sending them a message."}
{"id":"500913","timestamp":1508958240,"text":"I closed both Associated Bank and Fifth Third Bank via message after zeroing out each account."}
{"id":"509008","timestamp":1509898860,"text":"Sent multiple Secure Messages to close a Citizens Bank account with zero balance. Never heard any response. Account still shows online. Finally called in and was told the account has been closed. Weird."}
{"id":"509010","timestamp":1509899040,"text":"Also closed BMO Harris savings account via online-chat, but was told paper form would be mailed to me to be filled out in order to close the Smart Advantage Checking account. Ugh. If there’s no fee, I might as well leave it open, forever."}
{"id":"510467","timestamp":1510083120,"text":"BoA Personal Checking: closed over the phone.\nChat was unavailable when I was closing the account or I would have tried that."}
{"id":"517386","timestamp":1510886160,"text":"DP: I was able to close my last M&T account via a secure message. There were past DPs saying that you either had to do your last account in branch or via mail, but I had no problem. Maybe they changed their policy?"}
{"id":"520838","timestamp":1511288760,"text":"M&T: I sent two secure messages on Friday 11/17 and both of my accounts were closed today 11/21."}
{"id":"521963","timestamp":1511385360,"text":"DP –\nClosed Webster Premier Checking  via SM .\nDowngraded and Closed CItibank checking via SM ."}
{"id":"529149","timestamp":1512272460,"text":"Discover Savings:\nclosed regular and AAA thru SM. processed in <4 hrs.\n*kept AAII open – higher apy and for future ach push/dd."}
{"id":"530815","timestamp":1512501120,"text":"Just as an additional data point, I just closed out my Capital One 360 Checking account and 360 Money Market account over the phone."}
{"id":"533825","timestamp":1513012320,"text":"Closing M&T via secured message has been great until you get down to your last account. The bank requested an in branch visit or send a letter via mail. After speaking with CS you can also send fax to close out final account! They provided fax # 585-948-8635."}
{"id":"533827","timestamp":1513012440,"text":"Closed my PNC checking account through Live Chat. $0 balance. Took 5 minutes. Make sure you have downloaded all your statements before you chat. Account closure is instant."}
{"id":"533975","timestamp":1513031160,"text":"Closed BMO Harris via e-chat — very fast, efficient and hassle free (held acct for 8 months)"}
{"id":"534087","timestamp":1513049700,"text":"DP –\nKey bank closed via SM"}
{"id":"534092","timestamp":1513050660,"text":"DP –\nSantander closed via phone after answering following questions –\nname,dob,ssn,address,last transaction,date of account opening,reason for closure\ntransferred to supervisor who finally closed the account"}
{"id":"535945","timestamp":1513362840,"text":"DP-\nTD bank closed via SM"}
{"id":"537552","timestamp":1513610580,"text":"How do you close an Ally Bank Account?"}
{"id":"539536","timestamp":1513871340,"text":"Looks like Citi has disabled chat and secure messaging as a way to downgrade / close accounts? Is that just for me or are other people seeing that as well?"}
{"id":"541906","timestamp":1514397780,"text":"Sent Message to Ocean First Bank to close checking account and  received email:\n“Dear Valued Customer;\nThank you for your continued business with OceanFirst. We appreciate and value your relationship with the bank. \nWe are in receipt of your inquiry regarding closing your account. In order to close the account, you will have to stop by your local branch or mail a letter requesting the account be closed. If you choose to close the account via mail, please send a letter including the account number, address to mail the check, and phone number in case the branch needs to contact you. Please make sure to sign the letter so we can compare your signature to the signature we have on file.”"}
{"id":"543219","timestamp":1514555460,"text":"I was able to close my last M&T account via SM. The first time I asked they said I had to do it in person or via mail (which has a fee). I replied and said I’d be out of the country and had no way of doing either. That worked and they closed my last account after I gave a final confirmation via SM."}
{"id":"546551","timestamp":1515004860,"text":"I just closed a checking account with BMO Harris using chat.  The account had a very tiny balance remaining, and they said they’d mail a cashier’s check.  I verified there were no fees being charged."}
{"id":"546595","timestamp":1515011880,"text":"Successfully closed my $0 balance Fifth Third checking account in December 2017 via SM."}
{"id":"547074","timestamp":1515084900,"text":"I was just able to close my LegacyTexas account by sending a secure message"}
{"id":"549530","timestamp":1515621720,"text":"Closed First Tennessee via SM. Took 2 days for them to respond. Asked me if I want to zero out account first, or receive cashier’s check. I elected the latter, and received the check within a week. Simple."}
{"id":"553064","timestamp":1516636620,"text":"Just closed PNC via chat with $0 balance. Super quick and easy."}
{"id":"553823","timestamp":1516815900,"text":"I plan to close one of my 2 BofA checking accounts over mail or phone. Any idea how to proceed with balance transfer of remaining balance to my other BofA checking? I would like to have $0 balance when closing to avoid dealing with paper check. However, there is $1500 balance minimum to keep fee free. Are fees charged in the month I close the account? Or how shall I time the balance transfer?\nAlso, is the chat working to anyone? Trying it for a month and the chat is never available to me."}
{"id":"554139","timestamp":1516870980,"text":"closed Citi Checking thru chat 2 days ago (zero balance).\nchecked today and website is already reflecting a closed account – ‘details and activity info are N/A for closed accounts’.\nwas also told that i’ll receive my last statement in 7-10 business days."}
{"id":"554197","timestamp":1516897680,"text":"what reasons have you given for closing an account? just curious. would like some on hand for future closings. so far i’ve just said “no particular reason.”"}
{"id":"554725","timestamp":1517006820,"text":"PNC checking(virtual wallet) and savings closed via chat.  I had 0 balance.\nI don’t think the PNC live chat is always available.  For me, it showed up as a button right at the top center of the account page when I was logged in(left of the “Privacy” button, right of “PNC Online Banking”, directly above “Alerts”).\nIf you don’t see the button, maybe try checking again during a business day, during normal business hours?"}
{"id":"557752","timestamp":1517872560,"text":"Closed BMO checking via eChat and 2 M&T checking accounts via phone call without any problems."}
{"id":"559030","timestamp":1518146040,"text":"Closed a Sandy Spring Bank account by secure message after bringing the balance to $0. This is the first data point on the list for this bank."}
{"id":"559582","timestamp":1518297300,"text":"You can close Univest through this link:\nhttps://www.univest.net/personal-banking/close-an-account"}
{"id":"563672","timestamp":1519472040,"text":"DATA POINT:\nANDIGO CREDIT UNION (IL)\nI had to send a fax like it was 1984 to andigo with my member #, and checking and savings # to request to close my account. they wouldnt close it over the phone even with a 0 balance for several months."}
{"id":"563758","timestamp":1519507920,"text":"U.S. Bank – was able to close over secure message/email after first transferring out my balance.  The email response from US Bank said “While we don`t usually close accounts through the Email Operations Department due to potential security risk, I find little risk in processing your request, especially with all of the account at a zero balance.”  So YMMV since they said they don’t normally do it, but it is possible."}
{"id":"565366","timestamp":1519916160,"text":"I zeroed out my Wells Fargo balance a couple days ago, and they just closed the account without me having sent them a secure message yet."}
{"id":"566117","timestamp":1520027700,"text":"DP that’s not on here:\nClosed 1st United (both checking and savings, reply said they are “closing my membership”) effortlessly with a single SM. $5 min savings balance automatically mailed to my address."}
{"id":"566438","timestamp":1520129580,"text":"DP:\nSuccessfully closed both Union Bank and Columbia Bank (WA, OR) via US Mail account closing form in February 2018.  Union Bank deducted about $2 from each account though, so beware."}
{"id":"566718","timestamp":1520231160,"text":"DP:\nKey Bank – closed via SM (paid $25 ETF)\nSantander – closed via phone (no ETF)\nHuntingdon – closed via chat (no ETF)\nPNC – closed via chat (forfeited the $0.11 i had in the account. final statement lists it those $0.11 as “charges and fees”.)"}
{"id":"566719","timestamp":1520231220,"text":"looking for DP on easiest way to close S&T bank?"}
{"id":"566845","timestamp":1520272140,"text":"DP for M&T Bank: I just closed my last M&T checking account by secure message. No request for a signature as others have reported. Maybe the CFPB complaints about difficulty of closing accounts got them to rethink their procedures. Or maybe I just got lucky."}
{"id":"569269","timestamp":1520898660,"text":"Couple extra DPs:\nHuntington – closed via chat. They asked to go into a branch but I pushed and they allowed. Account must be zero or they’ll mail a check\nPopular Community Bank – closed via Secure Message. Zero’d out account beforehand\nNorthpointe – used the online form at northpointe.com/goodbye, I guess this is similar to Secure Message"}
{"id":"570762","timestamp":1521172080,"text":"DP:\nS&T – Direct Message *doesn’t* work.\nWill update with other potential methods – phone, chat, in-branch, etc."}
{"id":"571248","timestamp":1521300240,"text":"New bank for your list–Old National. Can cancel over the phone if it has a 0 balance, otherwise in branch."}
{"id":"574238","timestamp":1522104480,"text":"Closed an All America Bank (Redneck Bank) account with secure message after I dropped the balance to zero."}
{"id":"574641","timestamp":1522184400,"text":"DP\nSuccessfully closed Pinnacle Bank Diamond Secure Checking account over phone . The balance was brought down to zero before calling them .\nHad tried via chat initially which failed."}
{"id":"577636","timestamp":1522856460,"text":"DP:\nFulton Bank – SM *didn’t work*, directed me to branch\n– in branch worked, no ETF"}
{"id":"577954","timestamp":1522888800,"text":"After clicking on the link to close capital one MMA, it gave me “We’re sorry, but we’re unable to complete your request at this time. Please try again later.”\nIs calling the only alternative?"}
{"id":"579359","timestamp":1523284560,"text":"DP:\nPNC – closed via phone (chat unavailable online)\nno ETF"}
{"id":"583926","timestamp":1524157860,"text":"Northwest secured message worked: “Thank you for contacting Northwest. I have send your request onto the appropriate department. They will close your checking account and mail you a receipt.”"}
{"id":"584015","timestamp":1524165180,"text":"DP\nNew bank for your list: Popular Bank.  Successfully closed by sending them a secure message on 4/16/2018, after the account had been open just over 6 months.  First I emptied the account by sending the funds to WF and waited for them to arrive at WF before sending the message.  (FYI: Popular doesn’t charge a fee for transfers to external accounts.)  They didn’t reply to my message, but on 4/18/2018 I could no longer log on."}
{"id":"585831","timestamp":1524600720,"text":"DP\nWells Fargo checking was automatically closed on $0 balance. I think they do it on statement day if balance is $0"}
{"id":"587357","timestamp":1524850860,"text":"Another DP for M&T Bank\nClosed one of four accounts via SM with no fees and no questions.\nNo branch near me."}
{"id":"588644","timestamp":1525199400,"text":"DP\nFulton Bank: Secure message didn’t work.  They replied: “To ensure the security of our customers’ accounts, we require our accountholder’s signature to close an account. To make this request, please visit the Fulton Bank office most convenient to you. A complete listing of our office locations is available on our website. If you prefer, you may mail or fax a letter requesting to close the account. This letter should include your signature and instructions to distribute any remaining funds in the account. Please direct this to the office where your account was established.”\nThen I closed the account in person (after previously transferring all the funds to Wells Fargo so I had a zero balance).  Unfortunately the teller and the manager ran into problems closing my account while I was there.   (This was possibly related to me opening the account online.)  So I signed their form and they made a copy of my driver’s license, and an hour later they called to tell me the account was closed, and they mailed me a letter stating this."}
{"id":"588661","timestamp":1525200240,"text":"DP\nUnity Bank: Closed via secure message (after I had transferred all the funds to Wells Fargo so I had a zero balance).  This bank has an odd messaging system where you can send them a message but they can’t reply via the website.  Instead they sent me an email later that day that said “All paperwork will be processed today.”   Now the bank’s website still lets me log on, but no accounts are visible."}
{"id":"589802","timestamp":1525357500,"text":"DATA POINT:\nBridgeview bank (IL)\nClosed by phone call after ach to a $0 balance prior. easy,"}
{"id":"590428","timestamp":1525443660,"text":"first DP for Memory Bank:\nzeroed out balance, then closed via phone (887)757-3400 – just said it wasn’t working out for me. very pleasant.\nno ETF (early termination fee)"}
{"id":"592364","timestamp":1525886280,"text":"DP:\nWells Fargo Business Checking, closed via secure message, hassle free.  one message. Transfered out via ACH first, took a few days to close while transfer was pending."}
{"id":"592423","timestamp":1525894620,"text":"Successfully closed my Citi basic checking account via chat. Look likes secure message is no longer working, it simply says “Unfortunately, we cannot reply to your message in Secure Message Center. Please visit Citi’s Contact Us page for other contact options.”"}
{"id":"594109","timestamp":1526260200,"text":"DP –\nTD Bank – closed via SM\nno ETF"}
{"id":"596781","timestamp":1526678640,"text":"William Charles\nD.P. –\nUnion bank – Had to SM twice . the reply to first SM was the account will be closed in 3-5 business days , however in spite of not having any pending transaction it wast closed in 7 business days . Sent a follow up SM and the account was closed the next day with a SM apologizing the delay .\nHSBC – Closed via chat\nCitibank – Closed via chat"}
{"id":"602937","timestamp":1528320300,"text":"I closed an account at LegacyTexas Bank via chat."}
{"id":"604319","timestamp":1528742220,"text":"Closed zero balance Fifth Third Bank Checking with SM. Account closed same day."}
{"id":"604390","timestamp":1528754760,"text":"Just closed 5/3 bank checking with a quick phone call. I zeroed it out before calling. The CSR said it would take up to 2 days for it to be closed, to make sure there were no more transactions to the account."}
{"id":"604570","timestamp":1528809600,"text":"I was able to close my account at Valley National Bank by secure message."}
{"id":"605234","timestamp":1528920600,"text":"I tried to close my Bridgeview Checking Account, but the representative said I have to go to the branch to do that."}
{"id":"605242","timestamp":1528921260,"text":"Closed HSBC checking through chat"}
{"id":"609858","timestamp":1530211680,"text":"Another DP for Memory Bank:\nzeroed out balance, then closed by phone (887)757-3400.  They asked why and I just said I was consolidating some accounts.  Took 3 min and she said it was closed and I’d get a letter in the mail."}
{"id":"610229","timestamp":1530275520,"text":"Add DP for Northwest bank, I was able to close via SM.  I tried via their chat option, but they pointed me towards SM."}
{"id":"611581","timestamp":1530540000,"text":"Fifth Third DPs:\n– Personal Checking – able to close via SM\n– Biz Checking – NOT able to close via SM or phone, requires going to a physical location to send a slip ($25 closure fee too, instead of $50). On phone, stated that if you cannot make it to a physical location, there are options for you to mail documents in to close out the account."}
{"id":"611804","timestamp":1530568860,"text":"I usually just withdraw the balance and if they say it has a negative balance from fees in the future I tell them to shove it.  If the account balance is zero.  ITS CLOSED!"}
{"id":"612153","timestamp":1530631140,"text":"For E-Trade, log in to your account and then visit this link:  https://us.etrade.com/e/t/accounts/accountclosure"}
{"id":"614279","timestamp":1530976080,"text":"Huntington Bank: If you are within 10mi of a branch, they make you close the account in person at a branch. So antiquated!"}
{"id":"618593","timestamp":1531924980,"text":"Data Point:  I recently closed one of my BBT accounts which I had opened online by calling in and the representative simply moved my funds to my main account to zero out the account I was closing and told me that he would have to wait 24 hours before completing the process.  The funds were moved over to my main account a few hours after the call and the following day the account was gone.  🙂"}
{"id":"619624","timestamp":1532105820,"text":"Fulton Bank — Have to go to a branch, they do not allow mail-in letters or over-the-phone account closure.\nPNC Bank – Secure Message works for an account closure.  They do have to send you a letter stating the account will be closed.\nChase Bank – Will close over the phone, amounts less than $500 will be sent via check if I remember correctly.\nColumbia Bank NJ – Can close via a letter sent to their headquarters in Fair Lawn, NJ\nSantander Bank – They will close over the phone without any issues"}
{"id":"622121","timestamp":1532615220,"text":"Chase Checking & Savings – Closed within few hours via a Secure Message\nPNC – Closed overnight via a Secure Message\nBOA Savings – Closed right away by calling from mobile app\nCiti – Closed overnight after Chat\nBMO – Closed overnight after eChat\nCapOne 360 MM – Closed overnight after Chat"}
{"id":"625295","timestamp":1533156960,"text":"Just closed an M&T account by SM. Note that I still have other open M&T accounts. I zeroed this one out first, then sent the SM requesting closure. Response the next day: As per your request, I have closed your M&T Checking account ending in xxxx. You will receive your final statement via U.S. Mail."}
{"id":"626528","timestamp":1533316800,"text":"LegacyTexas has an online closure request for balances <$5k.\nYou can access it through \"Secure Forms\" then select \"Account closure request\".\nIt's an online form and has you enter your contact info and select account transfer or check for any balance remaining."}
{"id":"628047","timestamp":1533767400,"text":"My recent DP (all have been withdrew to 0$ balance):\n-PNC: by chat\n-5/3: SM\n-Huntington: denied by chat (I told them I’m moving, they said had to come to branch), called in later, close by phone w/o any problems\n-Hancock Whitney: by phone"}
{"id":"632401","timestamp":1534958700,"text":"I was NOT able to close my personal BB&T Bright Checking account by SM. I closed it by phone instead.\nI was NOT able to close my Business 200 Checking account by phone. Had to go in-branch to close it."}
{"id":"632408","timestamp":1534959480,"text":"Data Point (sort of):\nLakeland Bank (NJ & NY):  I zeroed out my Lakeland balance on 8/14 (by pulling all the money via Wells Fargo) and the bank automatically closed my account on 8/21 before I called to close the account."}
{"id":"636613","timestamp":1535576220,"text":"DP for Bank & Trust (Premier Valley Bank): closed savings account via secure message. called for checking account and closed it very quickly and easily, didn’t even ask questions beyond Last 4 + DOB. Took 15 seconds.\nMust be at $0 balance."}
{"id":"638641","timestamp":1536083580,"text":"Data Point: I was able to close my Memory Bank account via online chat today 9/4/18"}
{"id":"639088","timestamp":1536172560,"text":"DP:  as indicated by Doc,  BMO Harris closed via eChat."}
{"id":"639382","timestamp":1536240780,"text":"Hancock Whitney – ACH funds out on 9/4 and 9/5, called on 9/6 and cancelled by phone (800-448-8812). Once you get to a rep it’s only DL# and account number. No questions asked."}
{"id":"639460","timestamp":1536251640,"text":"@william Charles \nThe link to close account for capitol one 360 mm does not work anymore. I also could not find chat option"}
{"id":"640551","timestamp":1536534720,"text":"I closed my Incredible Bank account via SM."}
{"id":"641872","timestamp":1536803820,"text":"Huntington Bank:\nAccording to rep on phone, customers within 15 (or 50?) miles of a branch must go in person to close. At any rate account was 0’d and after asking my state of residence, rep did not allow me to close over phone."}
{"id":"642237","timestamp":1536869400,"text":"Closed MEMORY checking account today by live chat, balance $0\n– Nice lady: “May I ask the reason you are wishing to close? Is there anything we might be able to do differently.\n-Me: “The Banks to far from my place”.\n-Nice lady: “Thank you, I will process your request.\nDone"}
{"id":"642500","timestamp":1536884580,"text":"DP:  I closed our Incredible Bank accounts via SM."}
{"id":"642790","timestamp":1536944640,"text":"M&T Bank – Just closed my last checking account with them by zeroing out the balance and then sending them a secure message asking them to close it.  No issues that way."}
{"id":"642952","timestamp":1536989880,"text":"Thank you so much for the secret Capital One link to close!!! The new modern interface site doesn’t have any option to close. It still works; you just have to navigate back to Account Details, then click the ‘close your account’ link. Got the confirmation email right after."}
{"id":"643632","timestamp":1537213860,"text":"Closed Huntington checking via chat. Had around $100 left. They first said to go to a branch, and I told them we are XYZ away from the nearest branch. So then she let me close via chat with lots of verification."}
{"id":"644442","timestamp":1537368480,"text":"Closed BB&T Biz Checking by calling my “local” branch, which is 90 miles away.  Fairly quick process speaking to the local branch.  BB&T makes it more difficult to close biz accounts."}
{"id":"645713","timestamp":1537552080,"text":"Closed Citi savings and checking via chat"}
{"id":"645904","timestamp":1537572000,"text":"Old National Bank — closed using secure chat from online account (had zero balance)"}
{"id":"648146","timestamp":1538001600,"text":"Successfully closed my last M&T account via SM. I had zeroed it out already, and the account had been open for 17 months. Not sure if it matters, but this was also the first M&T account I had opened.\nBy the SM response it was clear they recognized it was my last account: “I am sorry to hear you will no longer be banking with us.”"}
{"id":"649079","timestamp":1538182080,"text":"Was able to close Old National by emptying then sending a secure message."}
{"id":"650765","timestamp":1538567280,"text":"Closed Cap 360 Money Market account via chat."}
{"id":"650766","timestamp":1538567340,"text":"Closed Fulton Bank in branch. No other way at least of this posting."}
{"id":"650939","timestamp":1538595720,"text":"Old National: Closed via SM after zeroing.\nAssociated: Closed via SM after zeroing.\n1st Source: Trying fax after zeroing, might work, might not. TBD."}
{"id":"653588","timestamp":1538905140,"text":"Capital one savings account – don’t see the close account button anywhere using your link."}
{"id":"655122","timestamp":1539172440,"text":"NBKC checking: closed via secured message after zeroing"}
{"id":"655125","timestamp":1539172860,"text":"BMT (Bryn Mawr Trust) in PA required to visit the branch even with a $0 balance\nAnd Flagstar in MI requires for me to send a letter because I live too far, that is after 6 months to avoid the $50 early closing fee"}
{"id":"655131","timestamp":1539174480,"text":"Closed 2 Memory Bank checking accounts via SM.  Very easy.  Received a check in mail for a penny (interest),\nClosed Elements account via SM."}
{"id":"655151","timestamp":1539177420,"text":"What’s the point of reposting if you don’t update your list? You cannot chat/SM BoA for years."}
{"id":"655157","timestamp":1539178680,"text":"Memory Bank – Sent them a secured message. They sent a cashier check for the current balance and closed the account."}
{"id":"655173","timestamp":1539180780,"text":"William Charles Lots of DP’s for you\nFlushing Bank – SM 9/24/18\nHSBC – Live Chat 10/10/18\nTD Bank – Call 10/9/18\nIncredible Bank – Call 10/01/18\nChristian Community Credit Union Call 10/02/18"}
{"id":"655221","timestamp":1539186840,"text":"Amazing lists like this is part of what makes DoC so awesome.\nCan any one of you imagine talking to a random friend that such resource exists?  It’s an extremely obscure topic that the average Joe who deals with two banks all his life will never understand."}
{"id":"655230","timestamp":1539189420,"text":"Just closed Citi checking and savings on phone. No problems. Sending check in mail."}
{"id":"655316","timestamp":1539199800,"text":"Andigo CU, Citi, and Chase can be closed via secure message. They sent a check for remaining balance afterward.\nHomestreet bank required a signed written request scanned and sent via email."}
{"id":"655416","timestamp":1539208620,"text":"Coffee’s for closers only!"}
{"id":"655486","timestamp":1539216720,"text":"With a zero balance… Chase automatically closes a checking account after 60days of inactivity. John 3:16"}
{"id":"655535","timestamp":1539224400,"text":"Fulton Bank DP:\n10/4 Successfully closed account that had a $0 balance after completing the $150 bonus by sending in a fax through faxzero.com using BMO Harris template: https://www.bmoharris.com/pdf/personal/account-closing-form.pdf\nReceived email confirmation of closure on 10/5 and logged in online to confirm account was no longer there."}
{"id":"658529","timestamp":1539724800,"text":"MT Bank needs to be a mailed in letter. I just tried the SM method and phone method and it didn’t work."}
{"id":"659090","timestamp":1539795540,"text":"Closed Alliant CU account through secure message"}
{"id":"659095","timestamp":1539795840,"text":"Incredible bank- closed secure message\nMemory bank – closed live chat\nUS Bank Checking/savings – closed phone\nCapital One Money market – closed online button\nHSBC Checking – closed secure message\nAscend FCU – closed phone"}
{"id":"660055","timestamp":1539915840,"text":"incredible bank – closed SM"}
{"id":"660334","timestamp":1539975540,"text":"CapitalOne ‘close account’ link still working 10/19/18. I had to use Internet Explorer this time. Copy & paste the link, then login. After you get the error, click a link to see something else, then go back to Account Details and you will see a link at the bottom “Close Your Account”. Click it and it will work this time."}
{"id":"661209","timestamp":1540215360,"text":"westfield bank MA wants me to either go to a branch or mail a NOTARIZED signature. love it."}
{"id":"662739","timestamp":1540426320,"text":"Santander – Closed account over phone. Account doesn’t close immediately. A “maintenance request” is put in and you’ll get a confirmation number. Will get an official letter in mail later documenting account closing."}
{"id":"663427","timestamp":1540560840,"text":"Hello everyone,\nI cant get regions to close my savings account via SM and im unable to go i to a local branch due to the fact that im active duty USAF pilot overseas. I read somewhere that i need to call and request an “account termination” or something like that i dont really remember what the forum said or which one it was.\nBecause im away from home i setup this savings account so i can tranfers funds to my kids gor holidays, birthdays, or emergencies but since the first 3 deposit were made the account has been on hold for over 4 months now due to the fact that 2 out of the 3 check had insufficent funds  which was unknown to me and i filed a police report because i sold personal items and explained it to regions via SM even threatened to file CFPB report against them and i cant for the life of me get them to close it and just send the funds to my registered address.\nI dont know when ill be back but it doesnt look like itll be anytime soon….any help wiuld be greatly appreciated.\nThnx\nETK"}
{"id":"667734","timestamp":1541383860,"text":"Please rename First Tennessee Bank to Capital Bank"}
{"id":"668019","timestamp":1541442000,"text":"DP – Wells Fargo – closed via SM. zero balance. they responded within 30 minutes. account closed."}
{"id":"668445","timestamp":1541497020,"text":"Closed account at Incredible Bank via SM."}
{"id":"673526","timestamp":1542321960,"text":"DP:\nProvident Bank – closed via SM with $0 balance"}
{"id":"674329","timestamp":1542478620,"text":"WF personal Everyday Checking.\nClosed via SM, with my withdrawal to bring account to a zero balance still pending. SM reply says account will be closed within 4 business days."}
{"id":"674441","timestamp":1542508080,"text":"On First Tennessee:\nSecure message worked and it was very, very simple. \nI messaged that I would like to close the account, and they messaged back saying they filed the close account form and it will be closed in 2-3 business days. I didn’t have to do anything."}
{"id":"674578","timestamp":1542558000,"text":"Closed Wells Fargo personal checking account via the Email Us form under Security and Support."}
{"id":"678977","timestamp":1543355220,"text":"A couple of DPs:\n(Minnesota) Bank & Trust – SM\nWells Fargo – SM\nBank of America – Phone (hold time was atrocious tho)"}
{"id":"679316","timestamp":1543379160,"text":"Tried to close my Huntington account via the chat CSR told me to go in branch."}
{"id":"686987","timestamp":1544195940,"text":"-BBVA Compass, in branch, took about 60 seconds.\n-Chase x2, secure message\n-BB&T secure message"}
{"id":"687843","timestamp":1544344500,"text":"I find it interesting USAA is not on this list.  I guess nobody leaves.\nDP:  USAA Savings account will close next statement cycle, or maybe one month after, when you have a $0 balance.  I don’t know if checking or other accounts are the same way.\nBackground: USAA gives a discount toward your insurance if you have any bank account with them.  (It’s a really small discount, but hell, take every bit you can get)  When I emptied my savings account to do an ACH transfer, and it seemed like they made sure it was marked as closed so I did get the discount on my next semi-annual insurance statement.  Was annoyed, but they can keep my business because they are top notch overall."}
{"id":"689442","timestamp":1544579880,"text":"CIT Bank lets you close with secure message. Done this 3 times (with a zero balance) as they play their ‘make a new account type every 6 months’ game."}
{"id":"689668","timestamp":1544632680,"text":"Was able to close Elements via chat yesterday."}
{"id":"692718","timestamp":1545155100,"text":"Closed Capital One 360 Money Market account today via online chat. Remaining balance transferred to external account on account automatically and no other question asked."}
{"id":"694183","timestamp":1545331020,"text":"Huntington did not allow me to close accounts via chat."}
{"id":"695420","timestamp":1545537780,"text":"New bank DP: Despite not really being in their area, my Wells Fargo account was converted to Flagstar. Sent Flagstar a SM to close, and instead was told I needed to go in person or send a signed letter. I chose the letter route instead of wasting more time trying to call, explain, and convince them to close it over the phone."}
{"id":"699894","timestamp":1546547460,"text":"2x Huntington P1 & P2 closed via chat.  They will tell you you have to go in branch, but if you reside in a state without branches, they proceed.  Will ask a few questions like acct number, amount of recent deposit, may ask to do text message or phone call verification code, and ask your mailing address.  Took about 5 mins per account.  We had already zeroed accounts.  They say it takes 1-2 business days to close, and to expect closing letter in the mail in 7 days."}
{"id":"700218","timestamp":1546616340,"text":"Memory Bank emailed me a “checking statement available” alert. When I signed in, the system showed no open accounts. Looks like they auto closed my account after 7 months with a $0 balance."}
{"id":"702369","timestamp":1546962420,"text":"Wells Fargo business account closed via SM."}
{"id":"702729","timestamp":1546991580,"text":"BMO – Thought I would be the pioneer and be the only person ever to close a BMO account via SM – online banking message center.  Nope.\nTried late November.  No response.  Tried Mid December – no response.  Had already zeroed account, so there was nothing they had to do.  \nTried Chat today – took less then a few minutes.  No questions asked.  6 weeks of goofing around for nothing.  I figured since they are no longer offering nationwide there was no hurry, but still!!!"}
{"id":"704770","timestamp":1547260200,"text":"Closed a checking account at LegacyTexas Bank by SM. Drew the account down to zero first.\nAlso, for some reason the other account closure DPs I’ve given for LegacyTexas Bank are listed under Legacy Bank."}
{"id":"704946","timestamp":1547324040,"text":"Huntington chat is showing as unavailable for me (not sure if that is only temporary). Attempted to call in to close and was asked if I was within 10 miles of a branch. After placing me on hold she informed me that I would need to go into the branch to close as I needed to sign paperwork."}
{"id":"707109","timestamp":1547659260,"text":"DP for Columbia Bank in WA, OR, ID (not the one in NJ) – I asked to close my business/personal accounts and was told I need to do so in branch."}
{"id":"708494","timestamp":1547853420,"text":"Some Quick DP’s for closing accounts that I closed today\nIncredible:  Live Chat (Also sent email upon confirmation of account closure)\nElements:  Live Chat\nBank of the West: Called in\nMemory Bank: Called In \nShould have tested Live Chat for Memory Bank, but didn’t think about it during my closing of accounts run.  But did Live Chat with Incredible/Elements to test them out."}
{"id":"709225","timestamp":1548042480,"text":"TD bank wont let you close an account via SM if you have a balance in the account. 2 DP’s from me and my wife"}
{"id":"709978","timestamp":1548169740,"text":"Navy Federal Credit Union:\nSent SM requesting to close checking account and transfer small balance to Share Savings.  Was completed in less than an hour."}
{"id":"710633","timestamp":1548264000,"text":"Easily closed BB&T personal checking via phone."}
{"id":"710972","timestamp":1548296460,"text":"Alliant Credit Union:\nSent SM requesting to close checking account and transfer small balance to Savings. Was completed same day and confirmed by reply."}
{"id":"714838","timestamp":1548956220,"text":"I was able to close my Wells Fargo checking today by logging in and sending an email, requesting the account be closed. About 20 minutes later, I received a response from Wells Fargo that my checking account was closed with today date as the effective date. Now, I had already transferred all money out with a balance of $0 when I sent the request to close the account, and I had already met the $500 direct deposit needed to waive the monthly fee for this cycle."}
{"id":"716473","timestamp":1549238280,"text":"Closed BB&T Bright Checking account via secure message"}
{"id":"716754","timestamp":1549302540,"text":"Closed HSBC Advance checking via chat without a problem."}
{"id":"717085","timestamp":1549334280,"text":"Anyone know how to close at TCF? Having a hard time figuring out how to do so online."}
{"id":"719248","timestamp":1549639620,"text":"Able to close M&T account via secure message after reducing account to zero balance – sent on 2/7, reply on 2/8 and account easily closed."}
{"id":"719414","timestamp":1549653600,"text":"Huntington DP from 2/8/19\nPhone rep refused to close over the phone, even with a $0 balance.  Insisted branch only.  Will send in a form letter I guess, since a branch is not at all close"}
{"id":"719597","timestamp":1549675320,"text":"Last week closed citi bank account in branch.It was super easy. no questions asked , no forms to fill. Just go to teller , get the cheque and out the door. in less than 5 mins i was out. super easy.  I prefer to go in branch as i am not perm resident yet."}
{"id":"720495","timestamp":1549920060,"text":"Fifth Third DP: Sent a letter asking them to close it. Instead, they emailed me back a form to fill out and fax or mail in."}
{"id":"720752","timestamp":1549960320,"text":"Closed Chase Savings with $300 and change after eight months of it being open and they transferred the money into checking as requested. Ready for the next savings deposit promo."}
{"id":"722713","timestamp":1550246280,"text":"closed Elements FCU via secure message. mailed account balance to home address.\nclosed Unify FCU via secure message. mailed account balance to home address.\nAttempted to close Valley National via SM. They responded that you must go in branch or email/fax signed letter to close."}
{"id":"722930","timestamp":1550263440,"text":"DP: Memory Bank – closed account via live chat, had zero balance at the time of closing. Also had to go through verification questions because I forgot to update mailing address after move and they had my old address in system."}
{"id":"723279","timestamp":1550334480,"text":"Hi DOC,\nFor Capital One Savings, it can no longer be closed via a button. It has to be closed via the Chat, which I was successful in doing. My assumption is because they ask where you want the Savings interest to go and have to do something on their side to move it to another account when it posts."}
{"id":"723367","timestamp":1550352780,"text":"Hey. Just want to supply a DP. Used Barclay Arrival Plus to fund PNC account 2000. Not considered a cash advance"}
{"id":"725072","timestamp":1550731380,"text":"Discover Savings:\nClosed account through secure message. Processed in a few hours, with a check with the remaining balance + interest mailed to me in <2 days."}
{"id":"726592","timestamp":1551039540,"text":"Closed PNC via Chat without any problems."}
{"id":"727447","timestamp":1551200460,"text":"Just closed Old National Bank via Secure Chat.  The balance must be $0 else they require a notarized letter requesting account closure with a copy of your drivers license."}
{"id":"727452","timestamp":1551200940,"text":"Great Lakes Credit Union.  Sent a message in their message center to close account.  got a reply email message the next day that a message was waiting in the inbox.  However, they  closed the account and deleted my access to online banking. But the online message did the trick"}
{"id":"727462","timestamp":1551202320,"text":"Closed BOA yesterday. Phone call that took only a few minutes. Balance was at $0 so I’m not going to get a check in the mail or anything. Got a confirmation email this morning and I can no longer sign in to my accounts. Painless process for me."}
{"id":"728099","timestamp":1551306720,"text":"DP for closing account with BMO Harris – sent secured message this AM and got response back later in the AM saying that since the account has already been zeroed out, they have submitted the request and it should be closed in 1-2 business days."}
{"id":"729290","timestamp":1551466980,"text":"Closed my HSBC Advance Checking via Online Chat today (3/1/2019), confirmed no fee if closing after 180 days. \nIt seems like they will mail you a check for the account balance, so you might not need to zero out the account before closing it. Although I did transferred all the available balance to my Direct Savings account before the online chat, the chat representative says I have $0.01 interest pending and they will mail me a check for that."}
{"id":"731420","timestamp":1551903840,"text":"Was able to close HSBC Checking this month via secure message, though didn’t get any response of the closure. Had logged in everyday after sending the message and about the 3rd business day later, logged into HSBC and saw the checking account gone. All the online statements for the checking account was gone too. I still have a HSBC savings account. HSBC handling of account closure is very poor. No email notification either. Save your statements if you need them before requesting account closure. If I didn’t also have a HSBC savings account, I wonder if I would have lost login access unexpectedly?"}
{"id":"733626","timestamp":1552391880,"text":"Santander Business – closed by phone."}
{"id":"735257","timestamp":1552651860,"text":"Closed Elements via Chat.  Didn’t take more than 2-3 minutes."}
{"id":"736019","timestamp":1552778880,"text":"Adding some DP here –\nPositioning myself to close two accounts last week, I drained the balance via bill pay in my State Bank of India (California) and Fremont Bank.  Within 24 hours, SB of India sent me an email notifying that my account was closed.  Fremont Bank didn’t notify me, but when I logged in a few days later the account wasn’t even showing in my online login any more.  To be sure, I called customer service and the automated banking system didn’t recognize my account number any more.\nA bit strange IMO given that both accounts were receiving semimonthly direct deposits, with the last one merely 10 days before my bill pay.  Seems a bit premature for the banks to just assume I didn’t need the accounts any more?  But it was a nice and easy way to rid myself of two checking accounts!"}
{"id":"744455","timestamp":1554412500,"text":"DP: City National Bank WV only offers in branch closing.\nThe story I keep getting is I must go into branch to close an account.  I tried SM, chat, and calling the local branch.  Even with an already zero balance account, they won’t close it.  I asked if I could mail or fax a letter – said nope.  Pretty sure if I called the corporate building enough I could get it done, if I made enough excuses, but I am currently losing the battle, nor desire to fight them on it."}
{"id":"744467","timestamp":1554413700,"text":"William Charles New DP: Mountain America Credit Union closed by Chat.  \nSM did not work.  Try replied back a few hours later that it couldn’t be discussed due to privacy concerns.\nMy account Spring Cleaning continues!"}
{"id":"744497","timestamp":1554415200,"text":"Tried closing M&T over secured message after reducing the balance to zero. Was told due to the interest bearing nature of the checking account it would have to be closed in branch or through mail. Filed CFPB complaint over the lack of convenient options to close the account."}
{"id":"744595","timestamp":1554425700,"text":"Suntrust (Personal) – Phone\nHSBC – SM/Chat"}
{"id":"744630","timestamp":1554429420,"text":"U.S. Bank – S.O. called to close.  Per rep, takes 2 days.  Cutting it close to statement date, but I think it will be okay.  Didn’t want to rely on slow SM response."}
{"id":"744770","timestamp":1554465900,"text":"At Amegy Bank, leaving an account at $0 balance overnight causes it to automatically close. If it doesn’t for some reason, you can close by SM."}
{"id":"744815","timestamp":1554474060,"text":"Dollar Bank – Tried SM to close account.  Was told to mail a letter to Corp HQ PO Box, or go in branch.  Dug up account opening folder and business card for my local branch and faxed them a letter.  Hopefully that’s a done deal, but of course I will have to follow up."}
{"id":"744917","timestamp":1554490260,"text":"William Charles TIAA Bank will close via SM, but takes a few business days.  (Your list says TIAA Direct, which is no more since Everbank took over)\nI had already zeroed balance, but I assume process would be the same with a balance.  After sending SM request to close, Day 1, you get a SM response that says they are forwarding the request to the appropriate dept.  Day 2, you get a regular e-mail stating service request has been initiated.  Day 3, you get a regular e-mail stating service request complete.  They keep your online login unlocked, so you can login and see the account is marked as closed.  Looks like they may have adjusted/collected a few pennies of interest.  With most banks, that’s usually forfeited, but I wouldn’t be surprised if I get a 3 cent check.  These are teachers…."}
{"id":"744918","timestamp":1554490620,"text":"I easily closed my business checking over the phone yesterday… they didn’t ask any questions why I closed… I just need to wait till I can churn another bonus from them…"}
{"id":"746353","timestamp":1554838320,"text":"After zeroing out all accounts, closed:\nIncredible Bank via Chat\nBB&Tvia  secure message\nCapital One 360 via Chat\nPro tip for Savings account : Close it as soon as your interest posts as you’ll have few cents sitting in your account and they’ll be unable to close it.\nCapital One 360 CSR was very efficient and transferred 2 cents to my linked account at other bank to close the account.\nHope this helps someone."}
{"id":"746361","timestamp":1554838860,"text":"My DPs on closing our accounts the last 3 months:\n*BBVA clearconnect checking closed via SM, later confirmed with snail mail\n*BBVA amex CC closed via SM, later confirmed with snail mail\n*WF EZchecking closed via SM\n*USBank closed in-branch, won’t allow by SM or phone call\n*Suntrust personal and business checking closed via SM\n*Regions personal checking closed in-branch since it’s nearby, didn’t attempt to close via SM or phone call\nNote: all accounts had zero balance prior to request to close account via SM."}
{"id":"747190","timestamp":1554985020,"text":"Closed PNC virtual wallet via chat in about 5 minutes. Made sure balance was $0 and all transfers were cleared prior to closure. Was easily closed and no mention of ETF or anything."}
{"id":"747398","timestamp":1555015560,"text":"Wells Fargo Business account closed via Secured message. Investors Bank and Santander Bank could do not do it via letter and needed notarized signature."}
{"id":"749020","timestamp":1555427280,"text":"Rockland Trust closed via online chat. I had a zero balance, and it was not an interest-bearing account. I had to verify personal information and the most recent deposit."}
{"id":"749044","timestamp":1555431420,"text":"Any data points on Northfield Bank?"}
{"id":"749842","timestamp":1555591200,"text":"For Fidelity chat representative asked to call 800-343-3548 to close the accounts.\nTried the HUCA version of Chat and it worked on the second try over the chat."}
{"id":"749853","timestamp":1555593180,"text":"Recent DP on MTB account closure ~ ACH pulled remaining balance to zero and soon as balance posted zero, I sent SM to close account. Got quick reply account was closed. Soon as account closure confirmed, I deleted MTB on the list of banks under my bank hub."}
{"id":"750179","timestamp":1555681200,"text":"Flushing Bank – SM"}
{"id":"751071","timestamp":1555961700,"text":"William Charles The link to close the Capital One MMA/Savings account doesn’t seem to be working, it looks like it needs a question mark at the end like so:\nhttps://secure.capitalone360.com/myaccount/banking/closeAccount?"}
{"id":"751083","timestamp":1555963620,"text":"Successfully closed a Wells Fargo personal checking account via Secure Message on 4/22/2019. I had already brought the account to a $0 balance a few days before."}
{"id":"752660","timestamp":1556293080,"text":"A couple of Data Points, all for accounts closed in the past couple of days: \nAssociated Bank: Closed on the phone with a $0 remaining balance.\nChase: Closed on the phone with a $0 remaining balance.\nBank of America: Closed on the phone with a $0 remaining balance. \nWells Fargo Business: Closed via SM with a $0 remaining balance."}
{"id":"753271","timestamp":1556517180,"text":"HSBC – Closed via Chat.  SM response was taking too long.  Chat took a couple minutes.  My CSR asked if I wanted to waive/forfeit interest on savings – told him to forfeit.  SO did not get asked same question.\nChecks showed up Friday for both of us.  11 cents, and 1 cent.  Then Saturday we got the final account statement.  Model of inefficiency."}
{"id":"753272","timestamp":1556517660,"text":"Union Bank & Trust (VA) – Checking and Savings – Closed via SM with zero balance.  Takes a day or two to reflect in online banking.  Suspect I may be getting another 2 cent check in the mail as they have an odd closing transaction on the savings.  “04/26/2019 DEBIT ACCRUALS -$0.02”"}
{"id":"753497","timestamp":1556566140,"text":"GTE Financial DP:\nAfter using them for my CIP funding and leaving my account untouched for many months, I finally decided to close via a secure message last week.  Today, I received a check for $5, the amount of my membership deposit.  One less account to worry about."}
{"id":"753862","timestamp":1556634480,"text":"DP: Verity Credit Union\nSent a SM to customer service to request closure.  Was asked to download and complete a form from their website, and email back to them."}
{"id":"754686","timestamp":1556741640,"text":"US Bank was closed easily over the phone. No questions asked (although I did mention fees leading to my decision to close). Per rep, account closure takes two days to take effect; however, “account closed 5/01” appears as a transaction when logged into the account."}
{"id":"755292","timestamp":1556845860,"text":"I just closed my Discover Online Checkins account. I sent a secure message and got a replied less than 10 minutes after to tell me the account was now closed and remaining balance was being sent over to my house with a bank check. So easy."}
{"id":"756483","timestamp":1557188280,"text":"Sandy Spring Bank – closed via SM.\nYou can close account through SM, notarized letter, or branch."}
{"id":"758884","timestamp":1557764580,"text":"I closed Capital Bank (First Tennessee) on via secure message on 4/26/19.  They sent me a check for the proceeds in the account.  A word of caution.  They sent the check via US Mail certified return receipt.  I had to go to the post office to pick it up because I was not home to sign for delivery.  You can avoid this by zeroing out the account before closing it."}
{"id":"759403","timestamp":1557864360,"text":"Umpqua Bank can be closed via online messaging but they require your mailing address in the message and takes at least 3 days before they’ll respond back that it is closed. Calling expedites the process if you’re in a hurry to close."}
{"id":"759726","timestamp":1557942360,"text":"Valley National Bank. closed via secure message today. Zeroed out balance first."}
{"id":"764820","timestamp":1559173860,"text":"Capital Bank (First Tennessee) – Phone"}
{"id":"766103","timestamp":1559575260,"text":"I SMed HSBC to close my Premier account. They told me to call my relationship manager.  I called her and she said me that I needed to come in to the branch.  At the branch, I had to sign a form to close the account."}
{"id":"767848","timestamp":1559849820,"text":"Essex Bank – branch.\nCan only close account in-branch or by notarized letter."}
{"id":"768144","timestamp":1559910960,"text":"Closed US Bank over the phone in 3 mins."}
{"id":"769097","timestamp":1560262320,"text":"Wells Fargo (personal checking account) — messaged them on the website asking for it to be closed and they closed it, no questions asked."}
{"id":"772735","timestamp":1561076520,"text":"Quick and easy DP for Rockland Trust. Withdrew balance to zero, sent secure message, and got reply the next day saying it was closed."}
{"id":"772918","timestamp":1561123800,"text":"Another DP- Simple secure message for Cambridge Savings Bank did the trick."}
{"id":"773071","timestamp":1561141320,"text":"Recent DP on Bank & Trust (WI), tried to close via SM and they sent me forms to mail back to close. Decided it was easier to close in person."}
{"id":"774101","timestamp":1561414440,"text":"Citi – closed checking and savings via chat.  Took approx 10 mins, mostly just waiting on them to respond on the status.  Had $0 the balances before contacting them.  The only thing asked of me was to confirm mailing address, and then they submit the “request”.\nFinal response: “Your account will be closed in 1-2 business days, not including holidays or weekends. You will receive one final statement for the account within 5-7 business days to confirm the closing.”\nSM is no longer an option that I could find in online banking."}
{"id":"775037","timestamp":1561571580,"text":"Closed Bank of America Core Checking account ($100 bonus) today over the phone.  Was on hold for maybe 10 minutes before speaking with a rep.  Rep asked why and I just said I wasn’t using it as much as I thought I would."}
{"id":"775039","timestamp":1561571700,"text":"Closed Memorybank account over chat today.  Had a couple verification questions to answer but no problems overall.  Representative was nice and understanding.  Took about 5-10 minutes and said I would receive an account closure confirmation in the mail in 3-5 days."}
{"id":"777702","timestamp":1562109000,"text":"Closed bank of the west via sm yesterday with confirmation."}
{"id":"778277","timestamp":1562194260,"text":"Bryn Mawr Trust (BMT) – Branch or notarized letter only."}
{"id":"780423","timestamp":1562694540,"text":"Suntrust personal account closed via chat\nHancock Whitney account closed via phone call.  \nBoth took about 5 – 10 minutes."}
{"id":"780808","timestamp":1562771460,"text":"Just closed Great Lakes Credit Union via online chat."}
{"id":"780820","timestamp":1562773020,"text":"Closed Discover online bank account thru SMS"}
{"id":"781296","timestamp":1562799360,"text":"Just closed One West Bank via online message."}
{"id":"781760","timestamp":1562873160,"text":"DP: BMO Harris\nIt appears live chat is no longer offered by them.  I attempted secure message and received a response shortly after stating they cannot close via secure message and to call in.\nCalled in, successfully closed via phone call, mostly painless."}
{"id":"786860","timestamp":1563849300,"text":"Northfield Bank (NJ) – Branch only"}
{"id":"790578","timestamp":1564409940,"text":"Closed Wells personal via SM. I’ll update the post with this DP."}
{"id":"794640","timestamp":1565130000,"text":"HSBC Direct Savings: Closed via online chat, check mailed for the remaining balance (~$5).\nTIAA (Yield Pledge Checking): Sent secure message through the old online banking interface but got no response; then called in to close the account, check mailed for the remaining balance (less than $1)."}
{"id":"795509","timestamp":1565281140,"text":"Capital Bank (First Tennessee) – Business \nClosed by phone."}
{"id":"796904","timestamp":1565616660,"text":"Closed Citi Checking and Savings by online chat. No issues. Reason: Sudden expense and need the funds which are liquid."}
{"id":"797598","timestamp":1565714820,"text":"closed\n-btt over the phone had to call online banking number to get to a human as I didn’t know the security code (probably never set it up) took about 20mins between hold time and actual closing -zero balance\nbbva- did in 5 minutes in branch\nhsbc-closed via chat 5 minutes"}
{"id":"798471","timestamp":1565826480,"text":"PNC Account; Missed bonus window, so went to close. Tried to over chat, wouldn’t let me – they said I had to call in. Successfully closed via SM."}
{"id":"807182","timestamp":1567854420,"text":"PNC (personal) – Live chat"}
{"id":"807287","timestamp":1567882560,"text":"To close a Bank of America checking account, secure message center no longer seems to work.  (used it before for other needs, but it’s not there now…. at least for me)   Had to call in to close the account. After a 15 minute hold, closure by phone completed."}
{"id":"809234","timestamp":1568297280,"text":"Another DP for Wells Fargo. Waited about 6 months from account opening as per advice here not to close the account straight away. Canceled direct deposit and transferred out funds leaving a $0 balance. Once the funds cleared into my receiving account, I sent a secure message and within 1 hour, the account was closed."}
{"id":"811686","timestamp":1568837460,"text":"DP:\n-Closed BMO harris via phone call.\n-BMO No longer offers chat service"}
{"id":"815513","timestamp":1569595860,"text":"DPs:\n– Citi – Phone\n– SunTrust – SM\n– PNC – Chat\n– TD – SM\n– BB&T – SM\n– Bank of America – Phone"}
{"id":"816900","timestamp":1569954240,"text":"DPs:\n– TCF Bank – Phone\n– Fifth Third – Phone\n– SEFCU – Phone\n– Elements Financial CU – Phone"}
{"id":"817228","timestamp":1569991380,"text":"BB&T – SM works.  Just slow, and mildly annoying, depending on your level of anxiety.  I had already zeroed account on 9/19.  \nSM Friday, 9/20 – please close account, no further transactions expected, here is my address and phone number to mail final statement.  Every day, 9/20-9/24 an e-mail would show up saying the account was either zero, or overdrawn.  \nEmail Subj: Zero/Negative Balance  “This is an automated message. Please do not reply directly to this email. Gadget: Zero/Negative Balance A negative account balance fee could be assessed to your account on the seventh calendar day that your account is overdrawn. For more details, log on to your online account and go to Accounts.”\nNo response to SM that I saw, but e-mails stopped on 9/24.  That day, online account access totally stopped working, like you used an invalid username.  Today, 10/01, Snail Mail letter arrives stating that the account was closed on 9/24.  \nSo, if you want a better experience, I suggest calling or going in branch."}
{"id":"817667","timestamp":1570056120,"text":"Hey DoC,\nGot a new DP for you.  Marcus by Goldman Sachs.\nClosed account today via phone call to 1-855-730-SAVE.  Easy and painless.\nI didn’t even close due to bank account bonus reasons.  I intended to keep the account open because their APY is so good.  Too bad they suck at some other things."}
{"id":"819523","timestamp":1570373580,"text":"P2 closed Regions Bank account via SM on 10/4/19. I was under the impression you had to call, but it looks like message still working."}
{"id":"820481","timestamp":1570564080,"text":"DP (DataPoint) for US Bank:\nI closed through Phone.\nFrom website:\nTo close your U.S. Bank checking or savings account, please visit your local U.S. Bank branch or contact customer service at 800-USBANKS (800.872.2657). Once all U.S. Bank accounts (except mortgage) are closed, online banking access will be turned off. If a mortgage account has been closed, online banking access will remain for one year after close."}
{"id":"821871","timestamp":1570739340,"text":"M&T Bank – I had called and the phone rep was very unhappy that I signed up for a bonus outside of their coverage area (reasonable I suppose). She had said I had to notarize some document and mail it into them.\nHowever, I then sent an SM to M&T after zeroing out my account and they closed it the next day."}
{"id":"823363","timestamp":1570816380,"text":"m&t said i cant close my account over the phone and i would have to into the branch because the account is interest bearing."}
{"id":"826189","timestamp":1571264580,"text":"Additions to the above list:\nDesert Community Bank closed via phone call, secure message or chat doesn’t work.\nOrion Federal Credit Union closed via fax though email or regular mail also works while phone or secure message doesn’t work."}
{"id":"827129","timestamp":1571418840,"text":"Keybank wouldn’t close over chat, had to call.  Also secure messages are no longer available (at least that I could find.\nShould also note that their automated call back system doesn’t seem to work.  I didn’t receive a call back number on two attempts.  Had to eventually wait through on hold."}
{"id":"830354","timestamp":1571962320,"text":"Bank of the West: Closed account 10/24/19 via secure message."}
{"id":"830757","timestamp":1572030120,"text":"Republic Bank – SM."}
{"id":"831963","timestamp":1572314580,"text":"Fifth Third (business) – In branch only. Denied via phone and SM."}
{"id":"832894","timestamp":1572464640,"text":"Data Point for M&T Bank closed via SM.  I closed my and SO’s M&T Checking this month via SM.  I got a reply that it was done a day or two later after I sent the message and I already had a zero balance in both accounts.  For my records, I logged back into both accounts to see the reply and screen shot the full message in the event of any questions later.  As a side note, I used a linked TD account to transfer and TD pulls the money over by the next biz day if the accounts are already linked."}
{"id":"833154","timestamp":1572497880,"text":"Varo – Closed via e-mail.  Used Help link from within app, as it will fill out the e-mail for you.  I included my contact info, including phone number and mailing address, as most banks want to verify that for closing statement, mailing a check, and 1099-INT purposes.\nThey take about a day to respond.  I had already zeroed the account, but they tell you:  “We have closed your account per your request. If you currently hold a balance, please allow fourteen (14) days for processing and mailing of the refund check.”\nI would have gladly kept the account, if they only allowed more than $500 in referrals in a lifetime.  Tear."}
{"id":"833201","timestamp":1572520500,"text":"Link not working for Capital One savings – “Access Denied\nYou don’t have permission to access “http://verified.capitalone.com/oigw/init?” on this server.”\nAny new link?"}
{"id":"834947","timestamp":1572893760,"text":"Wasn’t able to close Citi Checking account online. Tried the live chat, and they made me call them @ 1-888-248-4226"}
{"id":"836664","timestamp":1573069980,"text":"HSBC: Zeroed-out balance and started checking account closure process via chat.\n – should be completely closed within 2-3 days, after which final statement will be mailed to me"}
{"id":"836669","timestamp":1573070220,"text":"Bank of the West: Closed via Secured Message\n –  Should reflect a status of “Closed” within 5 days"}
{"id":"838799","timestamp":1573254900,"text":"I see comments here but I wonder if there is a general strategy to close account after getting the bonus (assuming have the account long enough to avoid the early closure fee if there is any)?   Is it better to first withdraw/transfer all money and leave 0 balance in the account?   Will the account with 0 balance be closed automatically?  For accounts requiring a minimum balance, will 0$ balance account incur a fee before it is being closed?  \nBear with me as I have never closed an account (I don’t have many in the first place).  Now I started to sign up accounts for bonus, I guess I will have to close accounts."}
{"id":"846366","timestamp":1574266860,"text":"First American Bank – SM"}
{"id":"848997","timestamp":1574724420,"text":"DP (Data Point) Bank: Simple.com\nIn order to close the account, you have to go to the website and go to Support -> Send a new message, and request to close the account. I called them and that is what they told me to do."}
{"id":"849004","timestamp":1574725500,"text":"DP (Data Point) Bank: TCF\nClosed over the phone.\nRepresentative said that it can also be done in-branch as an alternative method."}
{"id":"852571","timestamp":1575393780,"text":"William Charles Was able to close Chase Bank Checking and Savings with a Secure Message. I move balance of Savings account into Checking and used total checking amount to pay off a Chase Credit card so the accounts were both at $0. Closed the following day and I’ve had no issues so far."}
{"id":"853085","timestamp":1575477120,"text":"BMO (business) – Phone"}
{"id":"853595","timestamp":1575567240,"text":"You have “Northshore Credit Union” listed above, but then it links to a comment about “North Shore Bank”.\nAnyways, an additional datapoint for the bank: I called to cancel my account, and was told that I couldn’t cancel over the phone. “The easiest way is to come into the branch”, I stopped listening and planned on mailing in a letter, as a written request to close an account via mail should always work… but then thankfully she said “or send us a secure message via online banking”. Phew. I don’t know why anyone wouldn’t consider that the easiest way, but that definitely was the preferable route for me. Never encountered a bank that wouldn’t allow you to cancel via phone before, but I think secure message would be preferred by most anyways, so that works for me."}
{"id":"856336","timestamp":1576164480,"text":"Don’t think Capital One 360 Money Market still has the close account button, but using chat was quick and easy."}
{"id":"868663","timestamp":1578504540,"text":"Closed an IBERIABANK checking account via chat on the bank’s app.  Almost alarmingly simple."}
{"id":"873974","timestamp":1578882540,"text":"BMO Harris update: Called 1/12/20. If at a zero balance, can have phone rep submit request for closure. If there’s money in it, they cannot submit the request and you must take paperwork to a branch. OTHER OPTION: If at zero balance, automatically closes in 45 days."}
{"id":"875256","timestamp":1578971160,"text":"William Charles Incredible Bank auto-close 15 days from $0 balance. Hit $0 on a Thursday, received letter Monday stating my account would be closed. Very convenient."}
{"id":"883425","timestamp":1579622760,"text":"BMO checking & savings – would not allow closure via direct message, no chat available, and on phone they first accidentally hung up on me and the second time were able to process but indicated they would be mailing out forms to be signed and once returned would close the account and issue the check.  \nI could also bring it into a branch which defeats the purpose of trying to close online then on phone but I might do it just to be done with this bank. I’ve had more phone calls with them then all other banks combined in the past year because they failed to properly open my savings account, forgot to attach bonus code and months later made me send in a copy of the original promo voucher, didn’t pay bonus as scheduled, then paid only part of bonus, and now had to call multiple times to (almost) close account.\nI did not zero out the accounts but rather left the minimum balance in savings to avoid fee ($100)."}
{"id":"883540","timestamp":1579629840,"text":"HSBC premier checking – closed via bankmail (secured message), received response within a few hours.  “Please allow two to three business days for this account to fully close.” I did zero out account prior to requesting close as I already met the requirements to waive the monthly fee this cycle.\nThere is a chat feature but it was not working properly for me.  Bankmail was painless though."}
{"id":"883725","timestamp":1579640460,"text":"Citi Account Package – closed over phone, took <10 min.  Did not see option to send SM and Chat not loading (but chat not working may be an issue with my work computer).  Zeroed out accounts about a month ago as I have another account still open that waives potential monthly fee."}
{"id":"884550","timestamp":1579710240,"text":"TCF Bank — zeroed out checking account then closed using secure message:\n1/8 Sent SM to close checking account ending in xxxx\n1/13 They responded that account ending in xxxx is closed\n1/15 Online account status changed to “closed”\nDid the same thing for family member’s account as well"}
{"id":"886848","timestamp":1579875660,"text":"Wesbanco telephone agent says I have to go in branch"}
{"id":"886858","timestamp":1579876440,"text":"William Charles Cambridge Savings MA (https://www.cambridgesavings.com/) can be closed via secure message, they required one response after asking if I’d gotten all my statements from the system as they are inaccessible after close.  Unify Credit Union can also be closed this way, they send a check out for the remaining funds in checking ($10 in my case) and the $5 in the savings account."}
{"id":"901794","timestamp":1581100320,"text":"US Bank: There is an option to SM, but it says to call the bank regarding closure of an account. Called in and it literally took 60 seconds."}
{"id":"905069","timestamp":1581389340,"text":"William Charles a couple new DPs from the last week:\nTCF Checking – I closed through secure message (and also a family member’s account)\nBank & Trust (MN)- I closed through secure message\nAll accounts had a zero balance."}
{"id":"907148","timestamp":1581551340,"text":"American Pride Bank: close via secure message or in branch. Not over phone."}
{"id":"926650","timestamp":1583252940,"text":"Midfirst Bank: Already had zero balance in the checking account, closed via using their secure message center in online banking."}
{"id":"927112","timestamp":1583284320,"text":"DP\nFor HSBC Premier account, I brought it to $0 on the 18th and on the 20th they closed it.  Not sure if this is a strike against P2, but it saved me having to do it."}
{"id":"929574","timestamp":1583502300,"text":"I zeroed out my balance via transfer, and then a couple days later, I closed my Citi checking account in about 5 minutes using the chat feature. Very courteous very efficient. I was told I’d receive one more statement."}
{"id":"929580","timestamp":1583502780,"text":"And I closed the HSBC Premier via chat… again, zeroed it out. There were a few questions about DD and recurring transactions, but no hassle, very professional and efficient. Maybe 10 minutes."}
{"id":"933838","timestamp":1583896380,"text":"DP: KeyBank no longer has Secure Message SM. You can use the chat feature to close accounts. (And that pesky $25 ETF still applies within the first 180 days of the account.)"}
{"id":"944112","timestamp":1584980160,"text":"CIBC USA you can close with SM when account has a zero balance"}
{"id":"944145","timestamp":1584983340,"text":"DP: Hancock Whitney – Closed checking and savings via phone, but I had already zeroed the balances, and I am OOS.  Recommend using the “Contact Support Now” link in online banking to get a callback.\nWhen I called the main HW phone number, going through the phone menus, I ended up getting routed to Louisanna.  They said they could not close the account, and I needed to call the specific FL branch where I opened the account.  Well, that number to the branch was going straight to VM.\nI decided to use the link in online banking to “Contact Support Now”, and it had me enter my phone number to get a callback.  The person that called me back a few minutes later was able to close the account.  I just had to verify my identity via a text message and took maybe 5 minutes or so to complete the call."}
{"id":"949085","timestamp":1585692600,"text":"Hanmi Bank closes automatically within a week after you zero out the account."}
{"id":"953427","timestamp":1586284140,"text":"Orion Federal Credit Union – via secured message:  requested transfer of membership deposit to checking account for ACH external transfer, then closing"}
{"id":"954059","timestamp":1586358060,"text":"Fremont Bank: Will close account automatically two days after you zero out the account."}
{"id":"955522","timestamp":1586547600,"text":"PSA: Never trust a CSR, volume 1048\nSimple (hybrid) bank – You CAN close via SM.  They may not actually complete the task though.\nP1 & P2 submitted the close request at same time, on 3/14, via SM on their respective logins.  P1’s accounts are closed as of 4/1.  Shows a closing $0.00 transaction posted 4/1 on the account.  When you view the account numbers, it shows (closed) next to the digits.\nP2’s accounts are still active, still with a $0.00 balance.  I tried to reply to the original SM, but it forced me to create a new message.  The website says to expect a 5 day response time. 🤢"}
{"id":"956629","timestamp":1586804220,"text":"Bank of America personal – closed over the phone 4/13/2020.  Chat and secure message are no longer available."}
{"id":"956662","timestamp":1586808720,"text":"Fulton now allows closing via SM in 2020 per this post:\nhttps://www.doctorofcredit.com/de-dc-md-nj-pa-va-only-fulton-bank-200-checking-bonus-direct-deposit-not-required/#comment-946884"}
{"id":"956666","timestamp":1586809920,"text":"With U.S. Bank, if you zero out the account, then do nothing, they auto-close after four months (they snail mail a warning)."}
{"id":"957441","timestamp":1586923920,"text":"FYI: been trying to call BMO Harris to either request a fee waiver or close account for three days now. They’ve apparently disabled their phone line because it auto hangs up before connecting to agent."}
{"id":"962607","timestamp":1587601740,"text":"Closed PNC over the phone (888) 762-2265. I requested account closure after the automated system read my account balance and asked what I wanted to do."}
{"id":"966882","timestamp":1588106940,"text":"Union Bank – Just closed a checking account over the phone. They had me on hold for a while, but will be mailing me a check for the balance."}
{"id":"967696","timestamp":1588201020,"text":"US Bank successfully closed via SM. They respond to the email you provide. Drained account to zero before reaching out and shortly after statement as not to get dinged with monthly fee. Rep emailed to confirm address and was quickly closed same day. Quick and easy."}
{"id":"970295","timestamp":1588439580,"text":"+1 success on closing Discover savings via Secure Message"}
{"id":"970296","timestamp":1588439640,"text":"1. HSBC (Business) – Phone\n2. UFB – Phone\n3. BB&T (personal) – Phone\n4. Columbia Bank NJ – branch only\n5. US Bank – Phone\n6. TIAA – Phone\n7. Dollar Bank – Fax (to their central processing center)\n8. Provident Bank – branch only"}
{"id":"972589","timestamp":1588693260,"text":"Fidelity Bank – Closed via chatbot after draining account. Actually super easy!"}
{"id":"982793","timestamp":1589875140,"text":"DP CIT Bank. New system is easy, no need to contact support via secure message:\nThank you for contacting CIT Bank.\nA small amount of non posted interest remains in the account. To close the account and transfer the funds to your linked external bank account, please follow the simple steps below to submit the Account Closure Form directly from your online banking session. The transfer amount will show as zero but will move all non posted interest.\n1. Click on the Customer Service tab on the top navigation bar\n2. Select the Account services link\n3. Select the Account Closure Form and follow the step to close your account\nYou may also request a check by mail to the address on file."}
{"id":"983215","timestamp":1589929380,"text":"DP Northpointe. Really easy: https://www.northpointe.com/goodbye/"}
{"id":"983790","timestamp":1590010620,"text":"LIberty Bank account closed via secure message."}
{"id":"984836","timestamp":1590163740,"text":"One American Bank DP\nFor those who still have this, or are closing for greener pastures now that they reduced their APY. I was able to close via SM on their site. I didn’t receive a response, but had zeroed out my account beforehand, and within a day or two it showed up as “(Closed)” next to my account online."}
{"id":"986339","timestamp":1590435180,"text":"DP for Fifth Third bank:\nSent SM message regarding a personal checking account with $0.00 balance, they replied:\nWe are able to close an account via email request if the account meets the following requirements:\n Non-interest bearing\n At a $0.00 balance and there are\n No items pending\nAlso if this is your only account and you have used Zelle, your Zelle token must be deactivated. Our records indicate that accrued interest is $0.01 on your account. Hence, unable to close the account.\nIf you would like to close your account by completing these steps reply to this email so we can close the account on your behalf. Note that simply bringing your account to a $0.00 balance will not close an account, you will need to request the closure as well."}
{"id":"993014","timestamp":1591363200,"text":"DP Iberiabank: Was able to successfully close via support chat/conversation. I had a $0.00 balance"}
{"id":"993031","timestamp":1591364880,"text":"Northwest Federal Credit Union closed via messaging. Account was closed the next day. \nSince a $1 could not be transferred out of the share account to zero out the account before closing, donated it to the Northwest Foundation rather than have them mail it to me."}
{"id":"995777","timestamp":1591817280,"text":"Old Missouri Bank: emailed via the “Contact Us” page on the website after zeroing out account balance.\nReceived an email from a banker the same day saying that they received the message and would be closing the account and cancelling the debit card."}
{"id":"996102","timestamp":1591856460,"text":"If you drain your account to $0, eventually they will close the account.  But in the meantime, would they charge you the monthly fee, resulting in a negative balance?   In particular, personal checking at Wells Fargo, Chase, and US Bank.\nDP: Closed HSBC via chat but took 30 minutes due to hold times"}
{"id":"996186","timestamp":1591880940,"text":"Discover Savings responded to SM quickly. I zeroed balance, and asked to close."}
{"id":"998471","timestamp":1592236260,"text":"Columbia Bank WA ID OR can be closed by sending a signed letter to the branch the account was opened at also according to online chat."}
{"id":"998477","timestamp":1592236860,"text":"Well Fargo, brought personal account down to $0 and it was automatically closed without a request.  Nice!"}
{"id":"998656","timestamp":1592255280,"text":"William Charles\nPNC closure DP: Secure message currently down (caution message indicates due to high volume they won’t be responding)…\nI thought it would just take longer, but after over a week of waiting, I noticed the chat feature within the app and was able to close within 5 minutes of chatting and agreeing to disclosures and provided a reference number.\nFelt it was worth sharing since the other DPs are old and specifically since I had always used SM and others might find it useful to know that route isn’t working at the moment (presumably since COVID shutdowns reduced their staffing)."}
{"id":"999460","timestamp":1592399460,"text":"I was able to close US Bank with 0 balance via “email us” on their website."}
{"id":"1000774","timestamp":1592591040,"text":"TCF data point. Closed via secure message with zero balance."}
{"id":"1006418","timestamp":1593460260,"text":"DP: Bank is America\nInitiated closure with BofA in app. Typed “Close Account” in chat window, chose account, clicked “Call Now”\nPhone dialed number with options already selected and connected me to someone pretty quick.\nVerified last 4 digits of account number, mailing address, and email address.\nI was off the phone within 4 minutes."}
{"id":"1006657","timestamp":1593487140,"text":"Closed Citizens Bank via SM and Peoples Bank Magnolia via email to Mary Fowler (though I bet you could via SM too). Both had to be zero’d out first."}
{"id":"1018892","timestamp":1595127960,"text":"Marcus by Goldman Sachs savings account DP:\nClosed account via ‘Close this account’ button found on website.\n On the account details page, next to the blue ‘Deposit or Transfer’ button, is a square button with 3 dots.\nClicking this shows a drop-down menu, with the last option being ‘Close this account’.\nThis takes you to a page that walks you through the closing process."}
{"id":"1020461","timestamp":1595359320,"text":"Dp for Wells Fargo. My checking and savings accounts both had $0.00. I sent a secure message, received a response, and had my accounts closed in just under 15 minutes."}
{"id":"1021715","timestamp":1595521920,"text":"DP for Citizen’s bank\nClosed via live chat."}
{"id":"1021719","timestamp":1595522460,"text":"DP for chase personal checking – closed via phone"}
{"id":"1022746","timestamp":1595629320,"text":"A DP about Wells Fargo not auto-closing… P2 had met the DD requirements for the month to waive the fee, but moved all money just under a week before the statement close hoping they would close it, and they did not auto-close.  If was fine – no fee charged – but had I just assumed it went to plan, it could have got a fee next month/overdraft, etc.   SM sent today to close – Awaiting response.\nIn August of last year, WF did auto-close my checking account when I was actually planning on keeping the account for a few months.  So, YMMV on that.\nA few months ago (pre-corona) I had a huge reminder to handle things online or by phone whenever possible, too.  While my vehicle was getting serviced nearby I thought I had some time to kill, I decided to walk into a WF Branch to close a WF savings.  Painful experience.  Took about 30 minutes.  First, had to wait just to see a banker, got asked a bunch of questions why, if there were any other products I needed, my goals, the weather, vacation plans, small talk, etc, then had to stand in line for a teller to get the remaining acct balance.  \nThe bottom line, don’t close in-branch unless you have no other options."}
{"id":"1025378","timestamp":1595984520,"text":"DP: VAntage West Checking account.\nSent secure message on 7/28/2020, and they closed it on the same day. I received their confirmation via secure message.\nReally easy and simple."}
{"id":"1028296","timestamp":1596406320,"text":"Verity CU: Online chat with representative. They will sent you a link to their account closure form and a return email address. Filled out the form and sent back via email. Accounts closed on the next business day, remaining balance mailed back to me with a check.\nGesa CU: Closed with a phone call. Offered option to withdraw the remaining balance first, but I opted for a check for the remaining balance. \nWells Fargo: Closed with secure message and zero account balance."}
{"id":"1040150","timestamp":1597966200,"text":"DP: EBSB (East Boston Savings, not to be confused with ESB, Easthampton Savings)\nClosed by SM after being told not possible via phone. Had already zeroed balance."}
{"id":"1049435","timestamp":1599342480,"text":"DP: you can close US Bank checking accounts over email (mine had a zero balance)"}
{"id":"1059505","timestamp":1600727040,"text":"DP: I was able to close a Huntington checking account with zero balance via live chat today\nWhen you close over chat they said they must send a request to the back office, which will take a week or two"}
{"id":"1060007","timestamp":1600801200,"text":"US Bank: Messaged to close, they emailed asking me to confirm address, replied to email with address = closed"}
{"id":"1061528","timestamp":1600973220,"text":"DP for Credit Union West. Easy to close account. Sent them a secure message, and then they emailed me a link via DocuSign to sign."}
{"id":"1065297","timestamp":1601499900,"text":"In general, when you zero a balance and then wait a few days to close, is there any risk of the bank trying to enforce a monthly fee?  Is it better to keep money in there and transfer it during closing?"}
{"id":"1073164","timestamp":1602733440,"text":"DP for Huntington: Auto closed after “90” days of zero balance. The letter they mailed says 90 days of zero balance and no activity, my math says it’s 3 statements closing with zero balance and no activity."}
{"id":"1086062","timestamp":1604685600,"text":"Another note for PNC, I closed through chat using the desktop website. I first tried to send a secure message and it gave me the popup stating that messages won’t be answered. After 30 seconds or so of staring at the popup, the chat box just mysteriously appeared on the page. Closing through chat was quick and painless."}
{"id":"1088326","timestamp":1605054660,"text":"Closed KeyBank via Live Chat during business hours. No hassle."}
{"id":"1088328","timestamp":1605054720,"text":"OnPoint CU: Tried secured message, but they said I had to call. Closed via phone."}
{"id":"1090625","timestamp":1605307500,"text":"US Bank:  Automatically closed after 3-4 months with 0 balance in the account."}
{"id":"1094327","timestamp":1605821280,"text":"BBVA automatically closed my accounts after 4 months with a $0 balance"}
{"id":"1105735","timestamp":1607525820,"text":"How do I close my account online"}
{"id":"1121297","timestamp":1609743060,"text":"Closed PenFed through email with no problems"}
{"id":"1123458","timestamp":1609998120,"text":"DP: Midfirst Bank\nI just sent a secure message on 1/2/2021, and in 3 days I received an email that my account was closed"}
{"id":"1123731","timestamp":1610050920,"text":"PNC has eliminated SMs in January ’21. No longer able to close that way. I closed by phone today."}
{"id":"1127538","timestamp":1610649360,"text":"Closed BoA personal checking via phone after zeroing out the balance. Maybe worth mentioning that one of my BoA credit cards had the account linked as the primary payment option and closing the account messed something up on their backend that prevented me from making any payments (to that specific card) until I called in again to get it fixed."}
{"id":"1133462","timestamp":1611599280,"text":"closed PNC successfully via chat on 1/24/21"}
{"id":"1138645","timestamp":1612367040,"text":"Closed DollarBank after 2 SM. First one told me to go to branch or mail to corporate. Second SM where I asked if I can fax, the rep responded that she has notified corporate and will be closed later that day. Checked next day and account shows closed. YMMV"}
{"id":"1140110","timestamp":1612536540,"text":"List of DPs all within the last couple of days and with zero balance unless otherwise indicated:\nBank of America – closed by phone (with a balance – they are mailing a check)\nSantander – closed by phone\nCitizens – closed by phone (painless)\nHuntington – closed by phone (pretty long wait time)\nFulton – closed by secured message (pretty quick, they “created a ticket” and closed next day)\nBB&T – closed by secured message (took a few days for them to close it)\nCitadel Credit Union – closed by secure message ( I had not zeroed out the account so took a couple of SMs back and forth for them to get me a check for the balance and close the account)"}
{"id":"1142705","timestamp":1612970700,"text":"Suntrust- closed via chat 2/9/2021.  Super easy, the automated portion picked up all the needed info, so the agent completed it in just one minute."}
{"id":"1142746","timestamp":1612975080,"text":"Sacramento Credit Union does not let you close online. They require going to a branch or mailing a letter."}
{"id":"1146178","timestamp":1613587860,"text":"U.S. Bank needs to be updated, you have to call in to close the account. I was just on hold for 15 minutes to get a rep to close it.\nhttps://answers.usbank.com/answers/s/article/How-do-I-close-an-account"}
{"id":"1150665","timestamp":1614298020,"text":"Was able to close Huntington account by chat – in the ‘ask us’ box bottom right , I typed ‘close account’.  Chat bot responded ‘to close your account, please visit a branch in person’.  It then gave a link to ‘contact us’, which then gave a link to click to chat live.  I chose the chat option, waited about 2 minutes for a rep, typed that I wanted to close my account.  They asked what was the reason, just said I needed to streamline my bank accounts, confirmed my address and phone, and they said the account would be closed within 7-10 business days.\nDid have to call to close my Capital 360 checking, only options were to call, mail, or fax – no secure message or chat function on the site."}
{"id":"1156975","timestamp":1615415400,"text":"I have 2 more DPs for USE Credit Union and Safe Credit Union.\nBoth let you close through chat. Very easy, no waiting and less than 1 minute of total time."}
{"id":"1163833","timestamp":1616257020,"text":"DP: Closed Rockland Trust by secure message yesterday."}
{"id":"1169482","timestamp":1617296160,"text":"Synchrony Bank savings account tried closing online through secure message. Was told to call. I called and closed no problem. It also says that it will close automatically after 60 days with 0 balance."}
{"id":"1172954","timestamp":1617836460,"text":"Just a heads up, Capital One Checking requires a phone call (or I presume a letter). They do not offer chat anymore.\nDP: I called up just now and spoke to someone after a 2 minute hold and entering in my information. It took a few minutes more for them to close the account. They did mention I’d be subject to a “consumer check” of some sort if I ever were to open an account again, whatever that means..\nhttps://www.capitalone.com/support-center/bank/360-contact"}
{"id":"1174115","timestamp":1618001400,"text":"Capital One 360 checking – called in to close."}
{"id":"1181456","timestamp":1619152680,"text":"Closed Fifth Third in literally 1 minute over chat with CSR"}
{"id":"1183903","timestamp":1619633220,"text":"HSBC still allow closure over SM"}
{"id":"1185023","timestamp":1619823300,"text":"I closed my US Bank checking today by secure email. I had a $0 balance."}
{"id":"1187294","timestamp":1620334440,"text":"South Shore Bank closed by chat. The balance was $0 when I asked to close it."}
{"id":"1205709","timestamp":1623601860,"text":"I was able to close my Dollar Bank checking account, with zero balance, via secure message"}
{"id":"1206871","timestamp":1623781260,"text":"Atlantic Union Bank (formerly Union Bank & Trust, et al.)\n+ Close via phone with zero balance.  1-800-990-4828\n+ Close in the branch, if you enjoy sitting at the banker’s desk for 20 mins talking about your goals and ambitions.\n– Does not allow closing accts via SM or e-mail, per my SM attempt.  \nUnknown:  I did not try chat."}
{"id":"1207622","timestamp":1623859800,"text":"Any tips for closing Chime?"}
{"id":"1210251","timestamp":1624377780,"text":"Comerica – Closed checking through SM with a zero balance.  SM response: Please allow up to five business days for the request to be completed. A final statement, reflecting your zero balance, will be sent to you through the U.S. Mail.\nWatch out for their $3 ACH fee when using their external transfers.  I mucked it up on P2’s account and ended up using Zelle to cover the fee last minute.\nInvestors Bank – Closed via SM with zero balance.  Responded and closed next business day.\nCampus USA CU – Closed via SM.  They mail you a check for the remaining share ($5) in savings if you zero checking, but probably not necessary to zero since they have to mail a check anyway."}
{"id":"1211021","timestamp":1624493580,"text":"Bank of America closing – Not sure who said you can close in app, but that is not an option.  The app forces you to call, even if you ask “Erica”.  The app help mentions you can close in a branch, or by mail.  No option to SM that I can find."}
{"id":"1219114","timestamp":1625694900,"text":"I didn’t see Chime on this list, but I just closed my account through the app. You click on the question mark in the upper left of the app and it takes you to “Chimebot.” You request to close the account and provide the last 4 of your social, then it connects you to a live chat. They then closed my account, no questions asked. Took about 3 minutes."}
{"id":"1223352","timestamp":1626396420,"text":"I was able to close Wings Credit Union via secured message.\n*can you remove my middle and last name from this, I didn’t mean to post that*"}
{"id":"1228334","timestamp":1627177380,"text":"Zeroed out and closed checking accounts at First Horizon Bank, First National Bank and South State Bank via SM in the past 2 weeks"}
{"id":"1229952","timestamp":1627443480,"text":"Citi Checking and Citi Savings closed at same time via chat. Note: CS allowed future date for account closure to give time for money to cash out."}
{"id":"1232864","timestamp":1627937280,"text":"DP – Monifi Closure\nCalled 800.440.1101 to close my Monifi relationship.\nTook three minutes and the CSR was very pleasant and didn’t pry as to why I was closing."}
{"id":"1250474","timestamp":1631201040,"text":"US Bank Close account\nOpened checking March 2021\n$400 Bonus posted May 2021\nClosed US bank Checking Sept 9, 2021 ( no way to do it SM online or app, had to call, it was 3 min).   No questions asked.  Super nice"}
{"id":"1259156","timestamp":1632864900,"text":"second datapoint, I was able to successfully close a Firstrust account using secure message"}
{"id":"1261699","timestamp":1633385280,"text":"Was able to close Santander over the phone."}
{"id":"1271261","timestamp":1634937360,"text":"I have been visiting here for a long time but never posted. Here are some DPs for closing bank accounts. Hope it helps. Zero balance in all accounts.\nFulton Bank: SM\nSantander: Phone\nChase: SM\nKey Bank : Live chat\nTD Bank: SM\nS&T Bank: Live chat (P1). Denied for P2 via chat. Had to do it via phone.\nHuntington: Live chat\nCitizens: Live chat\nCapital Bank: Phone"}
{"id":"1272966","timestamp":1635274980,"text":"Have to close Monifi by phone, can’t do it online."}
{"id":"1277207","timestamp":1635949800,"text":"Associated Bank can still be closed through chat and confirmed balance has to be zero.  They also have a minimum $10 transfer limit so I was unable to transfer out my small balance.  I made a partial payment on a bill with it to zero out as they said I’d need to go to the bank to close if I had any balance."}
{"id":"1285508","timestamp":1637263500,"text":"Closed Regions via chat.  SM was no longer an option."}
{"id":"1288483","timestamp":1637784060,"text":"Citibank DP:\nAfter zeroing out my account balance earlier this week, closed Citi Checking via live chat"}
{"id":"1292576","timestamp":1638341100,"text":"My SunTrust account hasn’t been closed. What should I do?"}
{"id":"1293059","timestamp":1638398040,"text":"Looks like Porte Bank has to be closed by phone, and the closure has to be done by a supervisor."}
{"id":"1293529","timestamp":1638461580,"text":"Re: Kabbage.  Searched far and wide, only came up with phone number to call and cancel.  Call took about 4 minutes, no issues, account closed the same day.  Make sure you zero out account before calling."}
{"id":"1304539","timestamp":1640366880,"text":"William Charles Citi chat is now only available via the app, and they are only able to close personal checking via app, business still must call in to 877-528-0990 (was given as direct number)."}
{"id":"1307323","timestamp":1640980020,"text":"Closed via SM: Quontic, Wintrust, Lili\nStar One required letter."}
{"id":"1309518","timestamp":1641397200,"text":"DP:\n-Closed BMO harris via phone call this morning. With some transaction verification, it took me about 8 minutes in total. The process is pretty easy. Just remember to keep your balance at zero before closing it."}
{"id":"1322067","timestamp":1643312340,"text":"Closed BofA through chat. I also had a negative balance of $12 due to the monthly fee since I forgot to close the account a week ago. Agent was able to reverse the fee no problem."}
{"id":"1338888","timestamp":1645755360,"text":"Myself and partner were each able to close our Fifth Third checking accounts through chat. They must be letting people do it now because PM’s (outbound) are disabled."}
{"id":"1345497","timestamp":1646888700,"text":"DP for First Commonwealth FCU (its like closing on a home loan): zeroed out checking and savings. Chatted and was told to either go in branch or send SM.  Did SM and got response within 24 hours to send updated ID which I did. Then received email from docusign to provide my digital signature which I did. Within 24 hours of signing, the account was closed. Whew, this one is the a first – copy of ID required to close AND a digitally signed document that authorizes the bank to close the accounts!"}
{"id":"1363511","timestamp":1649852280,"text":"Closed account at First National Bank (PA) via chat. Pretty painless."}
{"id":"1369433","timestamp":1650404160,"text":"FYI  William Charles\nSkyOne:\n* Tried using Secure Message but they asked to send a physical signed letter via mail to them\n* Instead I called and they were able to send out a check for my balance ($3.00) and close the account over the phone"}
{"id":"1373369","timestamp":1651152480,"text":"Fidelity: Was able to use automated chatbot to close account on 4/28. Also had $0 balance."}
{"id":"1373930","timestamp":1651247100,"text":"CItizens – Closed quickly via chat after zeroing out."}
{"id":"1376570","timestamp":1651768920,"text":"Investors Bank: Secure message via online banking (Same day or next business day)\nKabbage Business: Call (5 mins)\nBank of America Business Credit Card: Call (5 mins)"}
{"id":"1376670","timestamp":1651780680,"text":"Bank of America Premium Rewards Credit Card: Closed through online chat"}
{"id":"1380601","timestamp":1652454600,"text":"You can now close a Marcus account from the online UI.\nLog in > Click on account > click on three dots > close account > select account to transfer balance to > done"}
{"id":"1383622","timestamp":1653060360,"text":"5/3 checking: closed quickly and without hassle via chat in app."}
{"id":"1384038","timestamp":1653162960,"text":"Wells Fargo can now be closed online. Go to Accounts > Manage Accounts > Close an Account. Only takes a few clicks."}
{"id":"1385456","timestamp":1653527220,"text":"Personal Capital Cash can be closed with an email: https://support.personalcapital.com/hc/en-us/articles/4404745578519-How-can-I-close-my-Personal-Capital-Cash-account-"}
{"id":"1392727","timestamp":1654744500,"text":"Closed PNC via Secure Message in the app.  They ask why closing, and ask you to provide the account numbers, but it’s pretty basic"}
{"id":"1395437","timestamp":1655238780,"text":"Closed ECCU  personal checking account over the phone.  It had a decent interest rate 3% ($25k) there for a while but the rate drop and the bank has now rebranded to adelphi.  \nRep was very friendly on the phone at first but she got somewhat cold once she reviewed my account (probably saw the amazon GC charges).  Actually hung up on me before I could say thanks/bye which was a first for me."}
{"id":"1397596","timestamp":1655600760,"text":"Can I close a Truist account on line"}
{"id":"1416158","timestamp":1659019200,"text":"Bank of America – Personal Checking. Rep would not close via chat, had to call in."}
{"id":"1419496","timestamp":1659561360,"text":"Premier Bank (OH) – Called 1-877-367-8178 customer service number.  With $0 balance, closed over the phone.\nTBK Bank – Tried to close via SM, but the representative called me and left a VM.  Called the return number, 1-888-743-5346, which apparently is not the standard customer service number and picks up quickly.  With $0 balance, closed over the phone. \nBoth banks verify name, DOB, last 4, address, etc.  No guilt trips or attempts to retain the customer."}
{"id":"1420545","timestamp":1659720780,"text":"trying to close LMCU (Lake Michigan Credit Union) today, to close remotely they require a form be printed, signed, scanned, emailed or snail-mailed back along with photo of current govt it."}
{"id":"1420577","timestamp":1659723900,"text":"just called to close ETFCU (Evansville Teachers), was pretty easy.  Chat said must call via phone.  Called phone, no wait, CS rep just says okay sure, confirms address and says they’ll mail a check for remaining small balance.  Quick!"}
{"id":"1425492","timestamp":1660577100,"text":"Not sure if this DP is needed but TD Bank Checking account can still be closed with a SM after zeroing out the balance."}
{"id":"1434590","timestamp":1661861880,"text":"Closed Wells Fargo business checking over the phone with $0 balance. \nClosed South State Bank with $0 balance via secure message. I initially tried it over the phone, but despite the rep’s assurance, my account never closed that way."}
{"id":"1448873","timestamp":1663698540,"text":"Citizen’s bank: closed checking account 9/20/22 via chat"}
{"id":"1450980","timestamp":1663940880,"text":"Citi Personal Checking:\nAfter zeroing out my account balance earlier this week, closed Citi Personal Checking via live chat on website. Very easy."}
{"id":"1458104","timestamp":1664893680,"text":"U.S. Business Silver Checking was automatically closed after about 4 months of zero balance and no activity. After 3 months, I got a letter saying they would auto-close."}
{"id":"1467395","timestamp":1666030740,"text":"Citizens: Was able to to close by chat with 0 balance and just over 6 months from open date. At least agent said it will be marked closed.  Since there no good recent DPs on closing by chat, decided to post this here."}
{"id":"1468581","timestamp":1666158060,"text":"I closed my LLC’s Bank of America business account by going to a branch."}
{"id":"1471242","timestamp":1666557780,"text":"Wells Fargo, as of 10/23/2022 only phone call 1-800-869-3557 to close account, available 24/7 everyday or go to branch. \nOptions of chat, send secure message, twitter no longer available to close account."}
{"id":"1473872","timestamp":1666875900,"text":"Hometrust Bank.  Closed via phone but had to have $0 balance"}
{"id":"1479454","timestamp":1667529600,"text":"Chase Personal Checking – Closing via SM with zero balance still works.  Waited until 6 months after opening passed – didn’t try to outrun the ETF.  Do download your statements if you care, because the account disappears from your online banking after a couple of days.\nCSR Response:  Thank you for contacting us.\nI understand how important this is to you. We’re sorry you\ndecided to close your account and hope you consider us for\nyour future banking needs. \nWe will only close the account(s) you asked us to close.\nIf you have other accounts with us, those will remain\nopen. \nThe remaining funds in the closed account will be returned\nto you. \nHere’s what you need to know:\n – The account will close when there are no pending\ntransactions and there is a zero balance.\n – You must cancel any recurring transactions as soon as\nyou can and set them up on another account.\n – Make sure your account has enough money to cover any\nelectronic (ACH) debit transactions that may appear on\nyour account for the current business day(1), as well as\nany previously approved debit card transactions. This\ncould delay when your account closes.\n – If your account has a positive balance, we’ll mail you\na check for the remaining funds seven business days after\nthe account is closed unless you transfer those funds to\nanother account. If you recently updated your address,\nwe’ll mail it 30 days from the account closure. To receive\nyour money sooner, please visit any of our branches.\nHere’s what will change starting today: \n – You won’t be able to make purchases with your debit\ncard. \n – You won’t be able to deposit money to your account at\nthe ATM, online, by phone or at any of our branches. \n – You won’t be able to withdraw or transfer money from\nyour account at ATMs, online or by phone; you must visit a\nChase branch.\n – We won’t make Overdraft Protection transfers to or from\nthis account, if you are enrolled.\n – We won’t charge monthly service fees or Insufficient\nFunds Fees to the account being closed. \n – We won’t pay checks written from your account.\nWhen the account is closed, you won’t be able to:\n – Access your account activity or statements through\nchase.com, the Chase Mobile(R) app(2), or Chase by Phone.\n – Make recurring electronic deposits (such as Direct\nDeposit) and electronic withdrawals (ACH debits).\n – Receive interest on interest-bearing accounts. \nThank You,\nChase Email Servicing \n(1)”Business day” is a weekday that isn’t a holiday. If a\nrequest to close an account is received on a non-business\nday, it will be considered received the following business\nday.\n(2)Chase Mobile app is available for select mobile\ndevices. Message and data rates may apply.  Eric"}
{"id":"1480680","timestamp":1667677320,"text":"Varo Bank: Closed via chat within Varo app. Very easy, received email confirmation within 10 minutes of starting chat with customer service rep."}
{"id":"1484469","timestamp":1668027780,"text":"Able to close Chase checking through SM however they did call a few hours later to complete the process.  They asked why I was closing the account and tried once to get me to keep account open but when I declined they closed it within a minute or two."}
{"id":"1484703","timestamp":1668049080,"text":"Counter DP on Bank of America (BofA) personal checking…\nUsing the app, trying to close brings you to a bot-like chat, and it directs you to call.  No real advantage.\nRep asked me for the last 4 of my debit card… luckily he was able to look it up because I have no clue if I even requested one.\nKept it open 4 months – collected my $100 checking bonus.  No ETF.   Account disappears from online banking same day."}
{"id":"1498984","timestamp":1669848780,"text":"11/27/2022 PNC was able to very quickly and easily close account through live chat. Requires that you have no pending transactions (everything must be posted/settled)."}
{"id":"1522682","timestamp":1672439220,"text":"U.S. Bank Business Checking closed via live chat. Just had to confirm DOB and last 4 of SSN and they closed immediately. Zeroed out balance by paying on CC right before"}
{"id":"1523304","timestamp":1672531860,"text":"HSBC: closed checking account via live chat.  Balance was 0 via transfer (pull by SoFi). \nTeachers Federal Credit Union: Would not accept phone or email request.  They required a hand written letter, including my member # and address and drivers license. Sent photo of letter/ID via email (or mail or fax) to customer service as a PDF.  Balance was 0 via transfer (pull by SoFi)."}
{"id":"1535155","timestamp":1673897640,"text":"DP: KeyBank no longer has Secure Messages for years now. Closed via Secure Chat."}
{"id":"1535732","timestamp":1673973660,"text":"Closed 2 accounts today that had hit the 6 month mark:\nPNC – Secure chat, was kind of slow but fairly painless. Mostly they just needed to verify address and have you read some fine print.\nU.S. Bank personal checking – Couldn’t find a secure chat option so I called and the lady was lovely and just verified address and closed very quickly (was faster than the PNC secured chat lol).\nFor both, I gave the closure reason reason of “better interest rates elsewhere.”"}
{"id":"1542650","timestamp":1674765540,"text":"DP Wells Fargo:\n1/26/2023 Closed a Wells Fargo Savings account painlessly over the phone. Banker was able to transfer the balance to my checking."}
{"id":"1543287","timestamp":1674842160,"text":"DP Citi:\n1/27/2023 tried to close savings account that was opened 1/26/2023. \n“I understand, thank you. As the account was just opened yesterday, we would not be able to close it here in Live Chat.\nPlease contact New Account Servicing at 1-800-745-1534, Option 2, Mon. – Fri. 8 am – 5 pm CT. (for TTY: use 711 or other Relay Service).”\nChat did NOT work."}
{"id":"1553353","timestamp":1675967100,"text":"DP Bank of America:\nTried to close checking account by chat during business hours but told me I needed to call or go into a service center."}
{"id":"1561527","timestamp":1677081000,"text":"DP\nFifth Third 5/3 Bank:\nSuccessfully closed via Secure Chat on web with zero balance."}
{"id":"1571552","timestamp":1678304640,"text":"Confirming some of the more recent DPs that CapOne 360 won’t allow you to close online anymore. The link to the “close account button” no longer works, the chat tells you that you must call, and I even tried a fax but received a voicemail two days later to call in to close my checking and savings."}
{"id":"1589832","timestamp":1680375060,"text":"AXOS Bank – can close via the virtual chat assistant. $10 fee applies to sending check with remaining balance, so best to zero out first. Takes 2-3 days to process"}
{"id":"1599028","timestamp":1681675560,"text":"Closed Capital One Checking via phone call 800-655-2265. Chat service was only bot and I couldn’t find a human through there."}
{"id":"1601966","timestamp":1681937160,"text":"Closed PNC via Chat 4/19/2023\nOnce you are logged in to Online Banking you can contact a representative through web messaging by clicking “Message PNC” located under the “Contact Us” heading within the “My Accounts” page."}
{"id":"1605086","timestamp":1682358420,"text":"US bank can be closed via live chat during business hours. Takes a few days to process"}
{"id":"1605119","timestamp":1682360580,"text":"Huntington bank checking account can be closed via phone call, but it takes 14 BUSINESS days (lolwut)\nalso, you can close a Citi credit card via their automated phone tree; no need to talk to a human!"}
{"id":"1615838","timestamp":1683741300,"text":"To close Fairwinds Credit Union, open the “Additional Services” tab at the top of the screen. Then click “Documents and Forms.” Then open the “Account Closing” form and fill it out with how you want your balance returned to you. Super easy, took 1 business day to close it out."}
{"id":"1617207","timestamp":1683921120,"text":"5/12/2023\nCitizens: Chat\nHuntington: Chat\nHuntington’s chat bot won’t give you an agent if you type “account closure”. You need to request a representative, click on the chat option, and then request it in there once you’ve connected with someone. Painless after that."}
{"id":"1619504","timestamp":1684334220,"text":"More recent data point for PNC than those above. Was able to close my account via chat without any issues."}
{"id":"1623801","timestamp":1685038500,"text":"Regions Bank process to close checking account through the “Message Us” button:\nclick on “Message Us”  button\nclick on “Select to get started”\nclick on  “Help with my account”\nclick on  “Account information”\nclick on  “Checking”\nclick on  “Close account”\nYou will then be connected to live agent. They might ask for last 4 digits of account number. They will then put in ticket request to close account."}
{"id":"1631632","timestamp":1686326400,"text":"Chase: Secure Message\nWells Fargo: Option within Online Banking\nCitadel FCU: Secure Message\nFulton: Secure Message\nKeybank: Live Chat\nKeypoint FCU: Live Chat\nGo2Bank: Option within Online Banking\nHuntington: Live Chat\nTD Bank: Secure Message\nCitizens: Live Chat\nFNB: Live Chat\nJovia: Secure Message"}
{"id":"1633146","timestamp":1686585720,"text":"CIBM Checking:\nCalled to close after draining the account.\nLogged in while on hold and noticed the account was already notated as closed, it appears they auto-close accounts with zero balance."}
{"id":"1671081","timestamp":1691866560,"text":"Fidelity cash accounts can be closed using their virtual assistant as long as the account balance is zero."}
{"id":"1674887","timestamp":1692390180,"text":"Closed US Bank via chat on 8/18/23 (had to use the app to request to close account before live chat option became available)"}
{"id":"1677447","timestamp":1692721500,"text":"Closed Huntington Bank via live chat after initiating final transfer out."}
{"id":"1679103","timestamp":1692891720,"text":"PSECU. In app, go to Support, select Chat Services, and the automated chat bot will give you two options to close your account: A) call 800-237-7328 to talk to a service agent; B) download an Authorization to Close Account form at psecu.com/forms."}
{"id":"1683777","timestamp":1693521000,"text":"Truist – closes personal checking account via chat"}
{"id":"1696471","timestamp":1695046200,"text":"I tried to close a personal Bank of America checking account via live chat, but they said they can’t close it through chat and that I need to call."}
{"id":"1696860","timestamp":1695071880,"text":"I brought down the balance to $0 on my Fifth Third Momentum Checking account and then was able to close it via Live Chat on the web."}
{"id":"1698818","timestamp":1695260700,"text":"Citibank: Chat bot directed me to call to close a checking account, which was quick and easy."}
{"id":"1704981","timestamp":1695942300,"text":"Seacoast Bank – closed small biz account with zero balance over the phone and was told that accounts with 0 balance get auto-closed after 10 days.\nSynovus Bank – closed small biz account with zero balance over the phone (one biz owner)"}
{"id":"1718693","timestamp":1697736120,"text":"PNC spend account –  closed via chat.\nAgent send an online closure form which requires full account number so keep it handy"}
{"id":"1745281","timestamp":1700959740,"text":"Albert Neobank: P2 closed by text messaging 63937: Must be done from the phone number on the account. Google Voice is now ok (change to Google voice after initially registering with regular mobile). P2 was able to cancel the Genius trial and then close all in a single text."}
{"id":"1754061","timestamp":1702045620,"text":"USAA: used the chat bot on the web site to get a link to the online menu to close a checking account. Immediately closed."}
{"id":"1755372","timestamp":1702231200,"text":"VyStar – sent letter.  Chat didn’t work.\nSpruce – called 800 number.\nAndrews FCU – SM\nFifth Third – SM\nAssociated – SM"}
{"id":"1757474","timestamp":1702480500,"text":"Banner Bank – Closed via chat 12/12/23"}
{"id":"1762148","timestamp":1703103780,"text":"Santander required calling in"}
{"id":"1762194","timestamp":1703106960,"text":"Northwest Bank: used secure message\nExperian: called 833-804-0770\nCitizens: used chat\nUSAlliance: used chat\nSantander: called in"}
{"id":"1762705","timestamp":1703178060,"text":"AmEx checking: chat\nFirst Commonwealth FCU: SM"}
{"id":"1763387","timestamp":1703262240,"text":"BMO has a chat feature again through the web site. I closed my account today via chat."}
{"id":"1766435","timestamp":1703781180,"text":"citizens bank closed quickly through chat"}
{"id":"1767028","timestamp":1703868780,"text":"Discover: SM\nDelta CU: SM\nAlliant: SM\n  William Charles I’m getting the message above stuck in the spam filter."}
{"id":"1776503","timestamp":1705077960,"text":"Go2Bank: closed account with 200 balance via chat and requested a check. Took 2 minutes. Got email confirmation immediately."}
{"id":"1779223","timestamp":1705450380,"text":"Closed chase business checking through secure message today ($0 balance)"}
{"id":"1785738","timestamp":1706215200,"text":"Upgrade can only be closed by calling customer service – re: a secured message from them."}
{"id":"1786741","timestamp":1706370420,"text":"Educational Systems FCU — tried to close via email but they would not. Closed by phone."}
{"id":"1788843","timestamp":1706641320,"text":"NYCB (New York Community Bank) division of Flagstar Bank, you can close the account through Secure Message as the chat system says this is an option if you opened online. You need to chose Close Account as subject line and provide last 4 digits of account. You are not charged a closing fee of $15 if the account has been open over 6 months (which is required anyway for their bonuses)."}
{"id":"1790264","timestamp":1706777940,"text":"Service Credit Union can chat to close the account."}
{"id":"1794142","timestamp":1707277680,"text":"Travis Credit Union, was able to close via SM."}
{"id":"1794910","timestamp":1707407160,"text":"There are not any recent Chase Business DPs: So here is one: I was able to 0 the balance in Chase business and then SM to close it. Easy. Had the account for a little over a year though may not have been necessary to keep it open that long after bonus, just wanted to make sure the banker at Chase would get his comission as it was opened in branch and he mentioned that he would get credit only if the account was open for a year."}
{"id":"1801309","timestamp":1708576500,"text":"Chase – Tried to close a CD during the grace period via SM and they wanted me to call or go to a branch."}
{"id":"1811885","timestamp":1710176280,"text":"Wells Fargo personal savings acct – didn’t see the option to send a secure message but was able to use chat to close savings account and transfer remaining balance to checking. Quick and painless."}
{"id":"1813234","timestamp":1710365760,"text":"DP: Midland States Bank: Zeroed out account and was able to close via secured message."}
{"id":"1816772","timestamp":1710896280,"text":"DP: Citi Bank doesn’t allow you to close an account via chat, must call their phone number"}
{"id":"1817215","timestamp":1710960120,"text":"Citi – Tried to close via chat but was told I needed to call. Call took 5mins to close."}
{"id":"1817935","timestamp":1711051800,"text":"KeyPoint CU can be closed over live chat during business hours"}
{"id":"1819999","timestamp":1711473420,"text":"Just closed my US Bank checking account through Live Chat and it took less than 5 minutes. I couldn’t find the chat feature manually so I used the search phrase “chat with an associate” to connect."}
{"id":"1823789","timestamp":1711984140,"text":"Midland States Bank checking account closed by SM. Easy."}
{"id":"1828864","timestamp":1712767260,"text":"Huntington – 5 minute phone call.  Tried their automated assistant through the app hoping it would lead to a live chat but it just results in a “call or stop by a branch.” Used their “call me back” feature and they called within minutes, no issues or pushback."}
{"id":"1828931","timestamp":1712773500,"text":"You can close laurel road via live chat"}
{"id":"1831319","timestamp":1713215880,"text":"Hey, my recent experiences in 2023 and 2024 closing accounts so far:\nBank of America Checking & Savings: phone\nDiscover Online Savings: phone\nCitibank Checking: phone\nWells Fargo Checking: phone\nTD Bank Checking: phone\nCitizens Bank Checking: phone\nM&T Bank Checking & Savings: phone\nSantander Bank Checking: phone\nBMO Bank Checking: phone\nNYCB / Flagstar Checking: in-branch"}
{"id":"1838883","timestamp":1714662600,"text":"When is it recommended to close banks that don’t have any early close fees or bonus claw back terms?  I’ve seen people that claim they always close within a day or two of getting bonuses to reset the clock.  I’ve seen some mention 3 months, 6 months or even 9 months?"}
{"id":"1840312","timestamp":1714921620,"text":"BluPeak Credit Union closed within minutes after sending a secure message."}
{"id":"1843744","timestamp":1715547900,"text":"Valley Direct: zero balance (make sure this happens just after the 1st of the month if you had balance as interest accrues). SMd to close. Got response within couple business days. Unable to see response as after logging in no accounts showing and access to SM is no longer possible even though login still works. Appears successful close."}
{"id":"1849364","timestamp":1716518160,"text":"Wells Fargo closed on 5/23/2024 via phone.\nI couldn’t see a way to chat nor send a secure message.\nThere was an option online to close an account, but it said my account was ineligible even with the $0 balance."}
{"id":"1852204","timestamp":1717091760,"text":"I was able to close my Huntington account today via chat, so it appears to be an option again."}
{"id":"1862305","timestamp":1718905800,"text":"SouthState – able to close today via chat"}
{"id":"1862885","timestamp":1718993940,"text":"Closed Wells Fargo account online on 6/21. Moved balance to another account on 6/18 then got charged the overdraft fee right away so I made a transfer from another account to Wells Fargo to clear the balance and waited until it posted before I could close it. Only took three clicks to close it."}
{"id":"1866020","timestamp":1719595320,"text":"Holy cow amazing update- Wells Fargo now allows account closure (at least for personal accounts) online as a simple automated request.  Click the “Accounts” drop down at the top, then under “Manage Accounts” you will see “Close Your Account” as an option.  It then walks you through selecting the account to close, lists the various disclosures, and ends with a beautifully simple “Confirm Account Closure” button at the end.  Click approve and next screen shows account closed!"}
{"id":"1870118","timestamp":1720205880,"text":"You can close USAA online in 15 seconds."}
{"id":"1870362","timestamp":1720270140,"text":"Hey  William Charles – I notice First Tech Federal isn’t on this list yet. Looks like  ShawntheShawn👈🏾 has a data point though:\nhttps://www.doctorofcredit.com/first-tech-federal-credit-union-300-checking-bonus-2/#comment-1861470"}
{"id":"1875061","timestamp":1721066820,"text":"PenFed closed via chat"}
{"id":"1878629","timestamp":1721495580,"text":"Some DPs from July 2024:\n\nAlly (Savings and Spending Account): closed via secure message\nDiscover (Savings): closed via secure message\nTruist (One Checking): account was locked due to inactivity so I had to go into branch to withdraw remaining balances and close the account. If the account wasn’t locked or the balance was $0 I could have closed via phone.\nCapital One (360 Checking and Savings): couldn’t close via chat, had to call\nFifth Third (Momentum Checking): couldn’t close via chat, had to call\nWells Fargo (Everyday Checking): close automatically a few months after zeroing balance. No fees were charged."}
{"id":"1879796","timestamp":1721687760,"text":"BMO: Zeroed out balance. Dragged feet to chat to close; auto closed after 60 days of 0 balance."}
{"id":"1880921","timestamp":1721785920,"text":"I was able to close my checking and savings account at NWFCU (Northwest Federal Credit Union) through a Secure Message on their website."}
{"id":"1883457","timestamp":1722158040,"text":"Fifth Third: Closed in branch with teller. Zeroed out with Zelle.  Statements available for 90 days I believe on 53 website but account disappears from app when account closed. App Login still works."}
{"id":"1893428","timestamp":1723743480,"text":"I know this is probably a silly question for most of you – but I am just getting started on bank bonuses. Do you all zero out the account first by ACH transfer and then do the account closure request? I want to make sure I don’t zero it out but then get charged any account fees."}
{"id":"1893542","timestamp":1723753740,"text":"Axos Bank: chat bot “EVO” let me process an account closure.  Received the following message at the end:\n“OK, I’ve submitted a request to close the following accounts:\n• Savings *XXXX\nPlease be aware that an Axos Bank team member may reach out to confirm how you’d like any remaining funds to be issued. It typically takes 2 to 3 business days to close an account.”\nWill update if I encounter any delays."}
{"id":"1898165","timestamp":1724434320,"text":"Wells Fargo: closed P1 & P2 personal accounts today. At first, I thought I’d have to call, because there isn’t any online chat, and there wasn’t a way to compose a new message in the Message center. But then, when hovering over the “Accounts” drop down, there’s an option right there for “Close an Account.” Super easy. You do have to zero the account balance before it lets you do it. Note: we also have business accounts, which we actively use, so I wasn’t closing those – but, they were listed alongside the personal accounts, in the “close an account” window, so it looks like those would be just as easy."}
{"id":"1898194","timestamp":1724437680,"text":"Service Credit Union: Closed via online chat. Took just a few minutes. Agent asked some verification questions and submitted the request to close. Quick and easy, no filler questions (e.g., why are you closing?)."}
{"id":"1899614","timestamp":1724692740,"text":"Truist personal checking closed via live chat 8/26/2024."}
{"id":"1901678","timestamp":1724946360,"text":"Premier Bank (OH) closed via SM with 0 balance"}
{"id":"1903003","timestamp":1725128160,"text":"Northwest Federal Credit Union – closed via SM"}
{"id":"1907010","timestamp":1725742200,"text":"Suffolk CU – closed via SM. Asked to include member number and copy of DL in message."}
{"id":"1910048","timestamp":1726112400,"text":"Wells Fargo DPs are all from many years ago. You can close it from your account page. Click on Accounts>Manage Accounts>Close account."}
{"id":"1915970","timestamp":1726848720,"text":"Huntington Bank\nRelationship money market account closed via live chat using desktop, doesn’t work on the app\nBusiness checking closed in branch"}
{"id":"1924499","timestamp":1727974020,"text":"BMO Harris closed by Chat today. Took 2 minutes.\nHi there, MattyRex! I’d be happy to help submit your account for closure. Allow me just a few moments to review your account before I begin on this process.\n\nMattyRex, thank you for your patience while I was reviewing your account. I have just finished submitting your account for closure. Your account is set to be closed by the end of the day today."}
{"id":"1927377","timestamp":1728323520,"text":"Citi – closed via chat during business hours. I did try over the weekend just to see and they directed me to call to close it"}
{"id":"1936884","timestamp":1729694460,"text":"US Bank – closed via live chat 2024-10-10"}
{"id":"1937936","timestamp":1729810080,"text":"Capital One 360 Checking – wouldn’t let me close via chat, had to call. was super quick"}
{"id":"1945083","timestamp":1730840340,"text":"Wells Fargo – Closed via Chat. Quick and painless."}
{"id":"1945253","timestamp":1730856840,"text":"US Bank – Live Chat 2024-10-24"}
{"id":"1956143","timestamp":1732198800,"text":"DP 11/21/24\nCiti checking acct closed via phone call\nTried to do it over chat but did not work"}
{"id":"1956156","timestamp":1732200600,"text":"DP 11/21/24\nBank of America checking closed via phone call\nTried to close via chat but did not work"}
{"id":"1963191","timestamp":1733237940,"text":"Add SoFi to list:\nWas able to close checking and savings accounts via online banking. Logged in, clicked the More icon, and selected Close account. Easy!\nMore info here."}
{"id":"1966578","timestamp":1733701260,"text":"closed citi checking via chat by asking for live agent in the bot chat (dec 7, 2024)"}
{"id":"1968811","timestamp":1734034920,"text":"Closed Huntington via live chat on 12/12/24"}
{"id":"1975564","timestamp":1735343940,"text":"DP 12/26/24\nCiti checking accts for both P1 & P2 closed via online chat, they are mailing a check for the remaining balance ($10) for each account"}
{"id":"1978019","timestamp":1735854900,"text":"US Bank wouldn’t let me close a checking account without deleting all bill pay account"}
{"id":"1978674","timestamp":1735946280,"text":"Was able to close citi chkg by phone. Balance was already at $0."}
{"id":"1980566","timestamp":1736268480,"text":"I was able to close my Wings Credit Union accounts via chat."}
{"id":"1980795","timestamp":1736284980,"text":"I was able to close my First Horizon accounts via secure message."}
{"id":"1981738","timestamp":1736388840,"text":"Discover – Secure Message\nAxos Bank – Secure Message\nChime – Chat\nAll were at 0 balances."}
{"id":"1982750","timestamp":1736523780,"text":"Santander – Phone\nKeyBank – Online Chat\nCapital One – Told I can’t use chat to close account; had to call\nAll balances were $0"}
{"id":"1982801","timestamp":1736527620,"text":"American Express Checking – Chat\nPNC Bank – Chat\nBoth were at 0 balances as well."}
{"id":"1983155","timestamp":1736565900,"text":"Valley National Bank – closed via secure message. $0 balance"}
{"id":"1983817","timestamp":1736714220,"text":"Axos – Closed via their online chat bot EVO. Pleasantly surprised it had the power to do it. \nWish other banks had this."}
{"id":"1984861","timestamp":1736867040,"text":"Upgrade – closed via chat"}
{"id":"1985605","timestamp":1736954520,"text":"Fifth Third: Required call or in office visit to close checking and savings"}
{"id":"1989459","timestamp":1737504480,"text":"Truist Business – Closed in Person"}
{"id":"1990225","timestamp":1737642000,"text":"PenFed – closed checking via Chat.  Balance was $0"}
{"id":"1995049","timestamp":1738368780,"text":"I had a weird experience trying to close my Santander account.  Called into customer service phone number, told them I want to close, put on hold for like 5min, they ask for my email to send me something, put on hold for 5min again, receive email saying “my inquiry has been submitted for review”.  I don’t understand why they couldn’t just close it"}
{"id":"1999668","timestamp":1738891080,"text":"Closed Marcus via online account. Go to the individual account, click the 3-dot menu and Close Account. They were able to issue the ACH out to my Ally during the closing process."}
{"id":"2000569","timestamp":1739024820,"text":"Closed UFB savings via SM after emptying it, had to go back and forth with CSR a couple times because soon after they posted pennies of interest and I had to confirm my mailing address for them to send me my pennies in a cashier’s check. I offered to let them keep it but they would not."}
{"id":"2001657","timestamp":1739216580,"text":"Closed Wings FCU via Chat. They had to mail out a $5 check for the membership fee or something, after I had zero’d out the account"}
{"id":"2005024","timestamp":1739636460,"text":"Closed BoA personal checking account via phone call. They were nice enough to waive the monthly fee that had showed up after I zero’ed the account in preparation to close."}
{"id":"2025581","timestamp":1742325180,"text":"Citi checking – unable to close over online chat. Bot redirects me to call customer support. Called and cancelled in under 10 minutes. Make sure to use voice-enabled system. Touch-tone system doesn’t have cancel option."}
{"id":"2030332","timestamp":1742855520,"text":"US Bank quickly closed over live chat."}
{"id":"2030648","timestamp":1742909100,"text":"After years of Huntington claiming that business accounts can only be closed in-branch, P2 was able to close their Huntington biz account over the phone yesterday with zero pushback. 1-800-480-2001\nIt’s a promising sign, but YMMV."}
{"id":"2031187","timestamp":1742943480,"text":"People Driven Credit Union – requested to close via secure message, then they required a copy of a letter requesting the account be closed. I hand wrote one and took a picture, which was fine."}
{"id":"2037377","timestamp":1743703680,"text":"USBank let me close my $0 balance account through chat in the app. I was unable to find any chat option on the website."}
{"id":"2037392","timestamp":1743704580,"text":"I was able to close my Truist account via phone call. I tried first going through the secure message feature with no luck. Calling the support number worked perfect and I was able to close the account with no issues."}
{"id":"2037780","timestamp":1743735420,"text":"Axos Bank let me close my checking account via secure message (online banking). They requested me to transfer the funds so that account shows $0 before closing"}
{"id":"2040231","timestamp":1744118160,"text":"Truist – zeroed out balance and then called to close. Could not do it via chat on desktop or mobile, otherwise, pain free."}
{"id":"2040503","timestamp":1744136580,"text":"For Chase checking, if I’ve got a Zelle transaction used to zero out my account that shows as “Pending” in checking transactions, would that get in the way of a closure request?"}
{"id":"2044442","timestamp":1744749420,"text":"OnePay – chat\nas of 04/15/2025"}
{"id":"2045057","timestamp":1744835100,"text":"Capital One: Phone\nUS Bank Business: Phone\nChase Business: Secure Message at 0 balance\nChase Personal: Secure Message at 0 balance\nBank of America: Phone\nIt’s getting a lot harder to close stuff via chat/secure message these days, it’s mostly phone calls now."}
{"id":"2045606","timestamp":1744911420,"text":"Bask Bank\nzero balance for 15 days auto-closes account"}
{"id":"2046592","timestamp":1745074800,"text":"Upgrade – closed via chat"}
{"id":"2047917","timestamp":1745331360,"text":"US Bank Personal Checking – Chat via USBank App"}
{"id":"2049392","timestamp":1745524500,"text":"Wells Fargo Personal Checking – Online Banking\nLove that you can close this one online instantly."}
{"id":"2055848","timestamp":1746548460,"text":"Community Financial Credit Union  (michigan) – Chat in app, very quick no pressure"}
{"id":"2057605","timestamp":1746733440,"text":"BMO:\nPersonal could close via chat in Dec 2024\nBiz chat said I had to call in May 2025"}
{"id":"2060472","timestamp":1747174260,"text":"Just got done with the process of closing my Citi checking account. It can be done over chat, but they try their absolute best to make it as difficult to find as possible.\nYou have to first ask for a representative in chat, only THEN can you mention you want your account closed. And don’t even get me started with trying to do it over the phone…"}
{"id":"2065470","timestamp":1747870440,"text":"Marcus can be closed online. Click into the account >> 3-dots menu >> close account. It will offer to make a final funds transfer / accrued interest to a linked account as well, very convenient."}
{"id":"2067677","timestamp":1748274900,"text":"I have an interesting DP for US Bank. I had a personal and business checking that I closed at the same time. When I tried to close the personal account online, it told me I had to call.\nWhen I tried to close the business account, it gave me a chat option. Chat then let me close both accounts at the same time."}
{"id":"2071427","timestamp":1748929020,"text":"DP: Laurel Road Closed via chat during business hours. Agent said account would be “officially closed” within next 2 business days. 6/1/2025"}
{"id":"2071660","timestamp":1748976000,"text":"Flagstar opened in branch OOS was required to close in branch"}
{"id":"2075170","timestamp":1749562620,"text":"BoA: Tried to close via SM online but was told have to call"}
{"id":"2077715","timestamp":1749865440,"text":"US Bank DP: Was outside of business hours so I could only close through their automated call system. It doesn’t provide “close account” as an option, but it recognized what to do when I said it. Had to go one account at a time."}
{"id":"2086239","timestamp":1750863000,"text":"BMO: closed by chat at 10:45 AM. Balance was already $0. Clicked “BMO Assist” icon at top of “…/www/#/accounts” page, typed “Close checking account”. Bot offered “Chat with a banker” button along with phone numbers for customer support. I chose chat approach. Support rep closed it promptly on request."}
{"id":"2087096","timestamp":1750946280,"text":"Closed Chartway CU checking and savings easily over secure message on website."}
{"id":"2087725","timestamp":1751033280,"text":"US Bank DP\nClosed checking with $0 balance via an automated phone call. No real person, great for those scared of people."}
{"id":"2090763","timestamp":1751462580,"text":"Fifth Third Bank closing data point:\nOpened 4/28/25\n     Bonus 5/14/25.  $350\n       Closed 6/2/25 by phone. On hold about 12 minutes. Had .01 still in the account which they will mail me a check for. \nThanks Fifth Third!"}
{"id":"2096932","timestamp":1752243660,"text":"DP closures 7-11:\nWells Fargo – Online (there’s a “close account” button)\nBank of America – Phone call (they didn’t even ask why)\nBMO Harris – Phone call (no live chat button)\nCitizens Bank – Live chat"}
{"id":"2099722","timestamp":1752598080,"text":"Live Oak Bank savings appears to be only phone per website\nhttps://support.liveoak.bank/account-maintenance/how-do-i-close-my-live-oak-bank-savings-account/"}
{"id":"2100467","timestamp":1752679260,"text":"DP\nTruist personal – closed via chat 7/16/25\nAs an aside, since I used their ACH fees as my reason for closing, they offered to refund any past ACH fees to retain me."}
{"id":"2105520","timestamp":1753379400,"text":"Just closed both P1 & P2 Wells Fargo Checking accounts online. Required 0 Balance, but worked the day after transfer out. Very convenient, will churn again."}
{"id":"2105621","timestamp":1753386600,"text":"Truist auto closed after ~2 months of 0 balance"}
{"id":"2106075","timestamp":1753462980,"text":"Keypoint Credit Union closed through chat, though it was kind of a pain. I had to download the app and receive a push notification to close it."}
{"id":"2106122","timestamp":1753468740,"text":"BMO Harris checking account closed easily over online chat. Last comment attempting this seemed to indicate that this was no longer an option but perhaps it now is?"}
{"id":"2108739","timestamp":1753887720,"text":"MidFlorida CU – had to call (866) 913-3733 to close an account. The other 2 options were to visit a branch or to send a letter."}
{"id":"2108990","timestamp":1753905240,"text":"Dedham savings bank in MA is insisting on a branch visit (no way) or a signed letter mailed in order to close my account.  They claim they need this for documentation.  I think they just want to make closing as painful as possible."}
{"id":"2111278","timestamp":1754176440,"text":"ZYNLO will automatically close accounts with a $0 balance after 30 days, as of 9/2/25.\nMany DPs suggest you can close them even faster simply by using the debit card’s round up feature.\nI suggest freezing the debit card and/or closing checking if you want to keep a HYSA or Money account open.\nZYNLO also added a dormant account/escheatment fee of $20 after 365 days.\n30 Day Unfunded Auto Closure\nEffective September 2, 2025, ZYNLO’s unfunded account closure window is moving from 90 days to 30 days. This means if your account has a $0 balance for 30 consecutive days at any point, it will automatically close.\nUpdated Fee Schedule\nEffective September 2, 2025, …we are adding a $20 escheatment fee. If your account becomes inactive and dormant after 365 days of no activity…"}
{"id":"2112073","timestamp":1754330340,"text":"Citi personal checking and savings. Tried via chatbot but got directed to call."}
{"id":"2112170","timestamp":1754339220,"text":"DP\nWells Fargo 8/4, phone call, pretty painless  – August 2025\nCiti, via Chat  – July 2025"}
{"id":"2112193","timestamp":1754341500,"text":"Another batch of DPs\nCitizens Access closed 8/4/25 via live chat on website (I don’t believe they have it on the app)\nChase 8/4/25 via phone call\nWill report on Abington Bank & Easthampton Savings Bank (bankESB), (MA regional banks) in a bit."}
{"id":"2112314","timestamp":1754355720,"text":"DP\nBMO closed on August 1, 2025 using the live chat"}
{"id":"2112317","timestamp":1754355960,"text":"if u deposit huge MO volume, that helps close ur accounts ASAP too. or tell them ur income source from OF or weed. this method applies to almost any bank."}
{"id":"2112330","timestamp":1754357160,"text":"8/4 – Closed BluPeak CU accounts via secure message while on the app.  Completed the closures within 24 hours.  No online access thereafter."}
{"id":"2112355","timestamp":1754358960,"text":"Also need a post on which bank has the dumbest AI chatbot."}
{"id":"2112405","timestamp":1754363640,"text":"BMO:\nSM failed: “For security reasons, we are unable to close your account via this channel.” Lol.Zero-balance method is now 45 days (used to be 60): “A checking account with a zero balance will automatically close after 45 days. We would not charge a fee when at a zero balance.”Closed via chat."}
{"id":"2112408","timestamp":1754364120,"text":"kind of wonder how do people move out the deposits when closing the checking/saving accounts? by cashier check? personal check? multiple online transfers?"}
{"id":"2112658","timestamp":1754411640,"text":"William Charles   Chuck \nI’m not sure if there is a page already on this subject, but is there a page we can start that recommends what banks are worth keeping open? Some may not be churnable, or they have special offers for existing customers, or maybe they have good referral bonuses.\nI think it would be a great addition to the community (again, if it isn’t already somewhere)"}
{"id":"2112660","timestamp":1754412120,"text":"Wings Credit Union cannot be closed my secure message anymore:\n“Thank you for reaching out. Unfortunately, we are unable to complete this request via Message Center. Please call member services at 1-800-692-2274 or stop into the nearest branch for assistance.”"}
{"id":"2112713","timestamp":1754417100,"text":"Was just able to close my account with U.S. Bank through live chat"}
{"id":"2112936","timestamp":1754433240,"text":"All completed today – \nChime: App (Profile > Personal Info)\nDiscover: Secure Messaging (just over 2 hours from start to finish)\nAlliant CU: Chat (check for membership fee in 10-14 days)\nOnePay: Chat\nAlso, somewhat unrelated, changed Cornerstone (MA) checking account type via chat."}
{"id":"2113274","timestamp":1754481480,"text":"Orion FCU – I had a dormant account that I could not login to and gave up on phone contact after 15 mins on hold.  I just wrote a letter stating I had a dormant account and I wanted them to close it and send me a check for the remainder. I included a printout of the page I got with my account info when I opened the account.  Got a check for what I think was the full amount in less than 2 weeks that said “Account closed” in the notes field.  Bizarrely, the day before that check arrived I got a brand new debit card for the account."}
{"id":"2113276","timestamp":1754481660,"text":"Hanscom FCU – I was able to close my account through a secure message.  They sent me a check for the remaining funds in about a week.  Great place to get a 5% CD back when rates were 0% but they killed that program a year and a half or so ago. Hung on to see if it would come back but when they started up the $5/month inactivity fee I had to leave."}
{"id":"2113472","timestamp":1754501280,"text":"But how do we close our defunct Juno accounts?"}
{"id":"2113995","timestamp":1754578380,"text":"cap 1 checking account, i didn’t find anywhere to close online or via chat (Eno – AI) there is as of now no human chat… it stated I must call to close"}
{"id":"2114982","timestamp":1754688960,"text":"Trustco Bank (xposting):\nSo apparently, at this bank if an account gets to a $0 balance it enters a “deactivated” status, which is technically(?) closed but funds can still be added to it. After some period of time, like 10 months or so they said, it fully closes. If the account is deactivated and has no funds they can fully close it manually without the trouble of going in-branch. So for future attempts to close, mentioning that it’s at a $0 balance may do the trick."}
{"id":"2115055","timestamp":1754692140,"text":"I was able to close a Penfed checking account through chat yesterday."}
{"id":"2117414","timestamp":1755009420,"text":"Doesn’t even seem to be an option for a secure message or chat for BoA anymore. Had to close by phone.\nSame for Wells Fargo, but when logged in (at least on desktop) under Accounts, then the Manage Account section, there’s a “Close an Account” option that works as long as you have your account zeroed out."}
{"id":"2118825","timestamp":1755127020,"text":"Was able to successfully close my Chase Personal Checking account through secured message once account was zeroed out."}
{"id":"2119289","timestamp":1755188700,"text":"can you add sofi in the list? thx\n  William Charles   Chuck"}
{"id":"2120503","timestamp":1755292500,"text":"Bank of Hope\nCalled to close, need zero balance, and then account automatically closes after 3 days at zero balance. I noted this was quite accelerated, but they said it was in the terms of hte Simply Checking account."}
{"id":"2120888","timestamp":1755354540,"text":"Hello. I closed my u.s. bank checking account by phone. First I zeroed the balance and then I called 18008722657 then went through an automated messaging system to close the account and it told me it can take up to 10 business days to close. Such an easy process, it’s great."}
{"id":"2124156","timestamp":1755693840,"text":"Was able to request closure of Laurel Road checking account via chat today. Representative said it will take 2 days to process; I’ll plan to follow up when I’ve confirmed it’s closed in a few days."}
{"id":"2124338","timestamp":1755706800,"text":"DP Bank of America close my account. app did not work. chat an app did not work"}
{"id":"2131600","timestamp":1756505700,"text":"Schwab – live chat"}
{"id":"2132298","timestamp":1756589760,"text":"is it still possible to close WF with a secure message? I don’t see how to create a secure message in the message center on WF website."}
{"id":"2136477","timestamp":1757045040,"text":"Attempted to close my Flagstar account via chat but got the following reply:\nTo close an account you may visit a branch or mail a letter.\nIf you choose to mail a letter, please include the account number you wish to close, a good contact phone number, and an address.\nAlso, be sure to sign and date the letter.\nYou may mail it to the branch where you originally opened the account.\nIf you don’t remember that address you may mail it to 100 Duffy Ave Hicksville, NY 11801 Attn: Bank by Mail."}
{"id":"2143503","timestamp":1757805720,"text":"Bank of America – call"}
{"id":"2145838","timestamp":1758051360,"text":"**All had to be zeroed with no pending transactions.**\nPNC- chat\nCapital One- call, chat didn’t work\nTruist checking – chat (closes by midnight)\nTruist business- call (will take 2 days for final closure), chat stated go to branch"}
{"id":"2147358","timestamp":1758157320,"text":"Live Oak savings accounts with $0 balance auto close after 45 days.\nTheir stated policy is to close after 30 days with $0 balance."}
{"id":"2156718","timestamp":1759263960,"text":"US Bank: closed via automated system. 800-872-2657"}
{"id":"2156804","timestamp":1759271460,"text":"Capital One savings:  able to click “account services & settings” and then “close this account”   Super easy, for once."}
{"id":"2157138","timestamp":1759318980,"text":"American Express savings – you are given the option to close your account if you withdraw the full balance from Amex. No need to message or call."}
{"id":"2157987","timestamp":1759371540,"text":"delete"}
{"id":"2161053","timestamp":1759772700,"text":"10/06/2025 Closed via online banking. Accounts>Manage Account >Close Account  Did not check to see if available in app."}
{"id":"2161821","timestamp":1759855800,"text":"Marcus – can be closed online. Navigate to the account homepage, select the account. At the top of this page, hit the 3 dots and select close account."}
{"id":"2172810","timestamp":1761243780,"text":"Bank of Missouri – not able to do online, would have to call, but they close automatically after 3 days of $0 balance"}
{"id":"2173877","timestamp":1761343380,"text":"PNC dp – Closed via chat. On Chrome: Contact Us -> Message PNC. Was a virtual helper that connected me with a live person after a few prompts. They’ll give you a form to fill out, which you’ll need your Account # and physical address. For the Account # go to My Accounts -> Click the account -> Account Activity -> Go to Account and Routing Number"}
{"id":"2181206","timestamp":1762271100,"text":"BOA – Called main line and used app for security screening. Asked for call back versus waiting on hold, and rep closed account in less than 3 minutes."}
{"id":"2181464","timestamp":1762284240,"text":"I was able to close my USBank personal checking acct very easily through the automated system (after it verified my identity), didn’t have to talk to anyone! It asked me to confirm a couple times then I had a transaction showing “Account Closed Payoff With Outstanding Items” 0.00 before I even got off the phone. I did have it already at a 0 balance prior to calling.\nEdit: logged back into online banking and the acct is completely gone, only see the Business checking acct I’m keeping open for now"}
{"id":"2182879","timestamp":1762390440,"text":"Was able to close Chase Personal Account today using Secure Message with $0 balance."}
{"id":"2184132","timestamp":1762532160,"text":"Alliant Credit Union – There doesn’t seem to be a way to send secure messages anymore (October, 2025).  I sent a letter asking to close all of my accounts and received a check for funds after approximately 2 weeks."}
{"id":"2184136","timestamp":1762532520,"text":"T-Mobile Money – You can only close by phone call.  There is no listed address to send a letter or way to send a secure message via the platform.  If you are not a T-Mobile customer DO NOT call the T-Mobile line indicated on the one time code emails.  They can’t help you without a T-Mobile PIN which you have to way to create since you aren’t a T-Mobile customer.  Look on the TMM website on your account page to find the TMM direct line.  Those folks will be able to help you and you can close easily enough after listening to a 15-second retention pitch. You should get a check for any remaining funds after approximately 2 weeks."}
{"id":"2188681","timestamp":1763065800,"text":"I was able to close US bank personal checking accounts via chat for 3 accounts/people"}
